program(1.3)
[buildInfo = dict<string, string>({{"coremlc-component-MIL", "3500.14.1"}, {"coremlc-version", "3500.32.1"}})]
{
    func main<ios18>(tensor<int32, [?, ?]> attention_mask, tensor<int32, [?, ?]> input_ids) [FlexibleShapeInformation = tuple<tuple<string, dict<string, tensor<int32, [?]>>>, tuple<string, dict<string, dict<string, tensor<int32, [?]>>>>>((("DefaultShapes", {{"attention_mask", [1, 32]}, {"input_ids", [1, 32]}}), ("EnumeratedShapes", {{"000187c4", {{"attention_mask", [64, 64]}, {"input_ids", [64, 64]}}}, {"090f2853", {{"attention_mask", [1, 128]}, {"input_ids", [1, 128]}}}, {"0a731900", {{"attention_mask", [1, 256]}, {"input_ids", [1, 256]}}}, {"14e22cc3", {{"attention_mask", [8, 64]}, {"input_ids", [8, 64]}}}, {"155d1fbb", {{"attention_mask", [64, 384]}, {"input_ids", [64, 384]}}}, {"1a2a12fc", {{"attention_mask", [16, 512]}, {"input_ids", [16, 512]}}}, {"22c267bf", {{"attention_mask", [64, 128]}, {"input_ids", [64, 128]}}}, {"24cf7ddf", {{"attention_mask", [64, 32]}, {"input_ids", [64, 32]}}}, {"2721a294", {{"attention_mask", [16, 32]}, {"input_ids", [16, 32]}}}, {"29d5bec5", {{"attention_mask", [32, 256]}, {"input_ids", [32, 256]}}}, {"3a8c1bc2", {{"attention_mask", [32, 512]}, {"input_ids", [32, 512]}}}, {"4b9590f0", {{"attention_mask", [16, 256]}, {"input_ids", [16, 256]}}}, {"50450b3e", {{"attention_mask", [16, 128]}, {"input_ids", [16, 128]}}}, {"517b156a", {{"attention_mask", [8, 512]}, {"input_ids", [8, 512]}}}, {"53dd2036", {{"attention_mask", [32, 384]}, {"input_ids", [32, 384]}}}, {"6526d012", {{"attention_mask", [8, 32]}, {"input_ids", [8, 32]}}}, {"7b263bfe", {{"attention_mask", [1, 512]}, {"input_ids", [1, 512]}}}, {"89020357", {{"attention_mask", [32, 128]}, {"input_ids", [32, 128]}}}, {"92e182a7", {{"attention_mask", [1, 384]}, {"input_ids", [1, 384]}}}, {"964b98d6", {{"attention_mask", [64, 512]}, {"input_ids", [64, 512]}}}, {"a28995a1", {{"attention_mask", [16, 64]}, {"input_ids", [16, 64]}}}, {"a4e8f51c", {{"attention_mask", [32, 32]}, {"input_ids", [32, 32]}}}, {"aa3a1438", {{"attention_mask", [8, 128]}, {"input_ids", [8, 128]}}}, {"b0234bc7", {{"attention_mask", [8, 384]}, {"input_ids", [8, 384]}}}, {"ba32981e", {{"attention_mask", [16, 384]}, {"input_ids", [16, 384]}}}, {"cc37bcd3", {{"attention_mask", [8, 256]}, {"input_ids", [8, 256]}}}, {"d2679837", {{"attention_mask", [64, 256]}, {"input_ids", [64, 256]}}}, {"d8f542e5", {{"attention_mask", [1, 64]}, {"input_ids", [1, 64]}}}, {"e78bf925", {{"attention_mask", [32, 64]}, {"input_ids", [32, 64]}}}, {"f5a604ed", {{"attention_mask", [1, 32]}, {"input_ids", [1, 32]}}}})))] {
            tensor<int32, [1, 512]> model_embeddings_position_ids = const()[name = string("model_embeddings_position_ids"), val = tensor<int32, [1, 512]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(64)))];
            tensor<int32, [?, ?]> input_1 = sub(x = input_ids, y = input_ids)[name = string("sub_0")];
            int32 var_22 = const()[name = string("op_22"), val = int32(32)];
            int32 var_23 = const()[name = string("op_23"), val = int32(12)];
            int32 var_24 = const()[name = string("op_24"), val = int32(-1)];
            int32 var_27 = const()[name = string("op_27"), val = int32(384)];
            tensor<int32, [1]> var_42_axes_0 = const()[name = string("op_42_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [?, 1, ?]> var_42 = expand_dims(axes = var_42_axes_0, x = attention_mask)[name = string("op_42")];
            tensor<int32, [1]> var_43_axes_0 = const()[name = string("op_43_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<int32, [?, 1, 1, ?]> var_43 = expand_dims(axes = var_43_axes_0, x = var_42)[name = string("op_43")];
            fp16 var_29_to_fp16 = const()[name = string("op_29_to_fp16"), val = fp16(0x1p+0)];
            string var_45_to_fp16_dtype_0 = const()[name = string("op_45_to_fp16_dtype_0"), val = string("fp16")];
            tensor<fp16, [?, 1, 1, ?]> var_43_to_fp16 = cast(dtype = var_45_to_fp16_dtype_0, x = var_43)[name = string("cast_77")];
            tensor<fp16, [?, 1, 1, ?]> var_46_cast_fp16 = sub(x = var_29_to_fp16, y = var_43_to_fp16)[name = string("op_46_cast_fp16")];
            fp16 var_47_to_fp16 = const()[name = string("op_47_to_fp16"), val = fp16(-inf)];
            tensor<fp16, [?, 1, 1, ?]> attention_mask_cast_fp16 = mul(x = var_46_cast_fp16, y = var_47_to_fp16)[name = string("attention_mask_cast_fp16")];
            tensor<int32, [2]> var_54_shape = shape(x = input_ids)[name = string("op_54_shape")];
            int32 gather_0_axis_0 = const()[name = string("gather_0_axis_0"), val = int32(0)];
            int32 gather_0_batch_dims_0 = const()[name = string("gather_0_batch_dims_0"), val = int32(0)];
            bool gather_0_validate_indices_0 = const()[name = string("gather_0_validate_indices_0"), val = bool(false)];
            string var_54_shape_to_int16_dtype_0 = const()[name = string("op_54_shape_to_int16_dtype_0"), val = string("int16")];
            uint16 gather_0_indices_0_to_uint16 = const()[name = string("gather_0_indices_0_to_uint16"), val = uint16(1)];
            tensor<int16, [2]> var_54_shape_to_int16 = cast(dtype = var_54_shape_to_int16_dtype_0, x = var_54_shape)[name = string("cast_76")];
            int16 gather_0_cast_uint16 = gather(axis = gather_0_axis_0, batch_dims = gather_0_batch_dims_0, indices = gather_0_indices_0_to_uint16, validate_indices = gather_0_validate_indices_0, x = var_54_shape_to_int16)[name = string("gather_0_cast_uint16")];
            string gather_0_cast_uint16_to_int32_dtype_0 = const()[name = string("gather_0_cast_uint16_to_int32_dtype_0"), val = string("int32")];
            int32 concat_0_values0_0 = const()[name = string("concat_0_values0_0"), val = int32(1)];
            int32 concat_0_axis_0 = const()[name = string("concat_0_axis_0"), val = int32(0)];
            bool concat_0_interleave_0 = const()[name = string("concat_0_interleave_0"), val = bool(false)];
            int32 gather_0_cast_uint16_to_int32 = cast(dtype = gather_0_cast_uint16_to_int32_dtype_0, x = gather_0_cast_uint16)[name = string("cast_75")];
            tensor<int32, [2]> concat_0 = concat(axis = concat_0_axis_0, interleave = concat_0_interleave_0, values = (concat_0_values0_0, gather_0_cast_uint16_to_int32))[name = string("concat_0")];
            tensor<int32, [2]> input_3_begin_0 = const()[name = string("input_3_begin_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<bool, [2]> input_3_end_mask_0 = const()[name = string("input_3_end_mask_0"), val = tensor<bool, [2]>([true, false])];
            tensor<int32, [1, ?]> input_3 = slice_by_index(begin = input_3_begin_0, end = concat_0, end_mask = input_3_end_mask_0, x = model_embeddings_position_ids)[name = string("input_3")];
            int32 inputs_embeds_axis_0 = const()[name = string("inputs_embeds_axis_0"), val = int32(0)];
            int32 inputs_embeds_batch_dims_0 = const()[name = string("inputs_embeds_batch_dims_0"), val = int32(0)];
            bool inputs_embeds_validate_indices_0 = const()[name = string("inputs_embeds_validate_indices_0"), val = bool(false)];
            tensor<fp16, [30522, 384]> model_embeddings_word_embeddings_weight_to_fp16_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [30522, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2176))), scale = tensor<fp16, [30522, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(11722688))))[name = string("model_embeddings_word_embeddings_weight_to_fp16_quantized")];
            string input_ids_to_uint16_dtype_0 = const()[name = string("input_ids_to_uint16_dtype_0"), val = string("uint16")];
            tensor<uint16, [?, ?]> input_ids_to_uint16 = cast(dtype = input_ids_to_uint16_dtype_0, x = input_ids)[name = string("cast_74")];
            tensor<fp16, [?, ?, 384]> inputs_embeds_cast_fp16_cast_uint16 = gather(axis = inputs_embeds_axis_0, batch_dims = inputs_embeds_batch_dims_0, indices = input_ids_to_uint16, validate_indices = inputs_embeds_validate_indices_0, x = model_embeddings_word_embeddings_weight_to_fp16_quantized)[name = string("inputs_embeds_cast_fp16_cast_uint16")];
            int32 token_type_embeddings_1_axis_0 = const()[name = string("token_type_embeddings_1_axis_0"), val = int32(0)];
            int32 token_type_embeddings_1_batch_dims_0 = const()[name = string("token_type_embeddings_1_batch_dims_0"), val = int32(0)];
            bool token_type_embeddings_1_validate_indices_0 = const()[name = string("token_type_embeddings_1_validate_indices_0"), val = bool(false)];
            tensor<fp16, [2, 384]> model_embeddings_token_type_embeddings_weight_to_fp16 = const()[name = string("model_embeddings_token_type_embeddings_weight_to_fp16"), val = tensor<fp16, [2, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(11783808)))];
            string input_1_to_uint16_dtype_0 = const()[name = string("input_1_to_uint16_dtype_0"), val = string("uint16")];
            tensor<uint16, [?, ?]> input_1_to_uint16 = cast(dtype = input_1_to_uint16_dtype_0, x = input_1)[name = string("cast_73")];
            tensor<fp16, [?, ?, 384]> token_type_embeddings_1_cast_fp16_cast_uint16 = gather(axis = token_type_embeddings_1_axis_0, batch_dims = token_type_embeddings_1_batch_dims_0, indices = input_1_to_uint16, validate_indices = token_type_embeddings_1_validate_indices_0, x = model_embeddings_token_type_embeddings_weight_to_fp16)[name = string("token_type_embeddings_1_cast_fp16_cast_uint16")];
            fp16 quantize_0_scale_0 = const()[name = string("quantize_0_scale_0"), val = fp16(0x1.0ecp-7)];
            string quantize_0_output_dtype_0 = const()[name = string("quantize_0_output_dtype_0"), val = string("int8")];
            tensor<int8, [?, ?, 384]> quantize_0 = quantize(input = inputs_embeds_cast_fp16_cast_uint16, output_dtype = quantize_0_output_dtype_0, scale = quantize_0_scale_0)[name = string("quantize_0")];
            fp16 quantize_1_scale_0 = const()[name = string("quantize_1_scale_0"), val = fp16(0x1.76cp-9)];
            string quantize_1_output_dtype_0 = const()[name = string("quantize_1_output_dtype_0"), val = string("int8")];
            tensor<int8, [?, ?, 384]> quantize_1 = quantize(input = token_type_embeddings_1_cast_fp16_cast_uint16, output_dtype = quantize_1_output_dtype_0, scale = quantize_1_scale_0)[name = string("quantize_1")];
            fp16 dequantize_165_scale_0 = const()[name = string("dequantize_165_scale_0"), val = fp16(0x1.72p+1)];
            tensor<fp16, [?, ?, 384]> dequantize_165 = dequantize(input = quantize_0, scale = dequantize_165_scale_0)[name = string("dequantize_165")];
            fp16 dequantize_166_scale_0 = const()[name = string("dequantize_166_scale_0"), val = fp16(0x1p+0)];
            tensor<fp16, [?, ?, 384]> dequantize_166 = dequantize(input = quantize_1, scale = dequantize_166_scale_0)[name = string("dequantize_166")];
            tensor<fp16, [?, ?, 384]> embeddings_1_cast_fp16 = add(x = dequantize_165, y = dequantize_166)[name = string("embeddings_1_cast_fp16")];
            int32 position_embeddings_1_axis_0 = const()[name = string("position_embeddings_1_axis_0"), val = int32(0)];
            int32 position_embeddings_1_batch_dims_0 = const()[name = string("position_embeddings_1_batch_dims_0"), val = int32(0)];
            bool position_embeddings_1_validate_indices_0 = const()[name = string("position_embeddings_1_validate_indices_0"), val = bool(false)];
            tensor<fp16, [512, 384]> model_embeddings_position_embeddings_weight_to_fp16_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [512, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(11785408))), scale = tensor<fp16, [512, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(11982080))))[name = string("model_embeddings_position_embeddings_weight_to_fp16_quantized")];
            string input_3_to_uint16_dtype_0 = const()[name = string("input_3_to_uint16_dtype_0"), val = string("uint16")];
            tensor<uint16, [1, ?]> input_3_to_uint16 = cast(dtype = input_3_to_uint16_dtype_0, x = input_3)[name = string("cast_72")];
            tensor<fp16, [1, ?, 384]> position_embeddings_1_cast_fp16_cast_uint16 = gather(axis = position_embeddings_1_axis_0, batch_dims = position_embeddings_1_batch_dims_0, indices = input_3_to_uint16, validate_indices = position_embeddings_1_validate_indices_0, x = model_embeddings_position_embeddings_weight_to_fp16_quantized)[name = string("position_embeddings_1_cast_fp16_cast_uint16")];
            string quantize_2_output_dtype_0 = const()[name = string("quantize_2_output_dtype_0"), val = string("int8")];
            fp16 quantize_0_scale_0_1 = const()[name = string("quantize_0_scale_0_1"), val = fp16(0x1.5a4p+1)];
            tensor<int8, [?, ?, 384]> quantize_0_1 = quantize(input = embeddings_1_cast_fp16, output_dtype = quantize_2_output_dtype_0, scale = quantize_0_scale_0_1)[name = string("quantize_0_1")];
            fp16 quantize_3_scale_0 = const()[name = string("quantize_3_scale_0"), val = fp16(0x1.e38p-7)];
            string quantize_3_output_dtype_0 = const()[name = string("quantize_3_output_dtype_0"), val = string("int8")];
            tensor<int8, [1, ?, 384]> quantize_3 = quantize(input = position_embeddings_1_cast_fp16_cast_uint16, output_dtype = quantize_3_output_dtype_0, scale = quantize_3_scale_0)[name = string("quantize_3")];
            fp16 dequantize_167_scale_0 = const()[name = string("dequantize_167_scale_0"), val = fp16(0x1.0c8p-1)];
            tensor<fp16, [?, ?, 384]> dequantize_167 = dequantize(input = quantize_0_1, scale = dequantize_167_scale_0)[name = string("dequantize_167")];
            fp16 dequantize_168_scale_0 = const()[name = string("dequantize_168_scale_0"), val = fp16(0x1p+0)];
            tensor<fp16, [1, ?, 384]> dequantize_168 = dequantize(input = quantize_3, scale = dequantize_168_scale_0)[name = string("dequantize_168")];
            tensor<fp16, [?, ?, 384]> input_5_cast_fp16 = add(x = dequantize_167, y = dequantize_168)[name = string("input_5_cast_fp16")];
            string quantize_77_output_dtype_0 = const()[name = string("quantize_77_output_dtype_0"), val = string("int8")];
            fp16 quantize_1_scale_0_1 = const()[name = string("quantize_1_scale_0_1"), val = fp16(0x1.864p+0)];
            tensor<int8, [?, ?, 384]> quantize_1_1 = quantize(input = input_5_cast_fp16, output_dtype = quantize_77_output_dtype_0, scale = quantize_1_scale_0_1)[name = string("quantize_1_1")];
            fp16 dequantize_77_scale_0 = const()[name = string("dequantize_77_scale_0"), val = fp16(0x1.708p-6)];
            tensor<fp16, [?, ?, 384]> dequantize_121 = dequantize(input = quantize_1_1, scale = dequantize_77_scale_0)[name = string("dequantize_121")];
            tensor<int32, [1]> input_7_axes_0 = const()[name = string("input_7_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> model_embeddings_LayerNorm_weight_to_fp16 = const()[name = string("model_embeddings_LayerNorm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(11983168)))];
            tensor<fp16, [384]> model_embeddings_LayerNorm_bias_to_fp16 = const()[name = string("model_embeddings_LayerNorm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(11984000)))];
            fp16 var_26_to_fp16 = const()[name = string("op_26_to_fp16"), val = fp16(0x1p-24)];
            tensor<fp16, [?, ?, 384]> input_7_cast_fp16 = layer_norm(axes = input_7_axes_0, beta = model_embeddings_LayerNorm_bias_to_fp16, epsilon = var_26_to_fp16, gamma = model_embeddings_LayerNorm_weight_to_fp16, x = dequantize_121)[name = string("input_7_cast_fp16")];
            tensor<fp16, [384, 384]> model_encoder_layer_0_attention_self_query_weight_to_fp16_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(11984832))), scale = tensor<fp16, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12132352))))[name = string("model_encoder_layer_0_attention_self_query_weight_to_fp16_quantized")];
            tensor<fp16, [384]> model_encoder_layer_0_attention_self_query_bias_to_fp16 = const()[name = string("model_encoder_layer_0_attention_self_query_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12133184)))];
            fp16 quantize_4_scale_0 = const()[name = string("quantize_4_scale_0"), val = fp16(0x1.d5p-5)];
            string quantize_4_output_dtype_0 = const()[name = string("quantize_4_output_dtype_0"), val = string("int8")];
            tensor<int8, [?, ?, 384]> quantize_4 = quantize(input = input_7_cast_fp16, output_dtype = quantize_4_output_dtype_0, scale = quantize_4_scale_0)[name = string("quantize_4")];
            fp16 dequantize_4_scale_0 = const()[name = string("dequantize_4_scale_0"), val = fp16(0x1.d5p-5)];
            tensor<fp16, [?, ?, 384]> dequantize_4 = dequantize(input = quantize_4, scale = dequantize_4_scale_0)[name = string("dequantize_4")];
            tensor<fp16, [?, ?, 384]> linear_0_cast_fp16 = linear(bias = model_encoder_layer_0_attention_self_query_bias_to_fp16, weight = model_encoder_layer_0_attention_self_query_weight_to_fp16_quantized, x = dequantize_4)[name = string("linear_0_cast_fp16")];
            fp16 quantize_78_scale_0 = const()[name = string("quantize_78_scale_0"), val = fp16(0x1.544p-3)];
            string quantize_78_output_dtype_0 = const()[name = string("quantize_78_output_dtype_0"), val = string("int8")];
            tensor<int8, [?, ?, 384]> quantize_122 = quantize(input = linear_0_cast_fp16, output_dtype = quantize_78_output_dtype_0, scale = quantize_78_scale_0)[name = string("quantize_122")];
            fp16 dequantize_78_scale_0 = const()[name = string("dequantize_78_scale_0"), val = fp16(0x1.544p-3)];
            tensor<fp16, [?, ?, 384]> dequantize_122 = dequantize(input = quantize_122, scale = dequantize_78_scale_0)[name = string("dequantize_122")];
            tensor<fp16, [384, 384]> model_encoder_layer_0_attention_self_key_weight_to_fp16_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12134016))), scale = tensor<fp16, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12281536))))[name = string("model_encoder_layer_0_attention_self_key_weight_to_fp16_quantized")];
            tensor<fp16, [384]> model_encoder_layer_0_attention_self_key_bias_to_fp16 = const()[name = string("model_encoder_layer_0_attention_self_key_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12282368)))];
            tensor<fp16, [?, ?, 384]> linear_1_cast_fp16 = linear(bias = model_encoder_layer_0_attention_self_key_bias_to_fp16, weight = model_encoder_layer_0_attention_self_key_weight_to_fp16_quantized, x = dequantize_4)[name = string("linear_1_cast_fp16")];
            fp16 quantize_79_scale_0 = const()[name = string("quantize_79_scale_0"), val = fp16(0x1.f74p-4)];
            string quantize_79_output_dtype_0 = const()[name = string("quantize_79_output_dtype_0"), val = string("int8")];
            tensor<int8, [?, ?, 384]> quantize_123 = quantize(input = linear_1_cast_fp16, output_dtype = quantize_79_output_dtype_0, scale = quantize_79_scale_0)[name = string("quantize_123")];
            fp16 dequantize_79_scale_0 = const()[name = string("dequantize_79_scale_0"), val = fp16(0x1.f74p-4)];
            tensor<fp16, [?, ?, 384]> dequantize_123 = dequantize(input = quantize_123, scale = dequantize_79_scale_0)[name = string("dequantize_123")];
            tensor<int32, [3]> var_100_shape_cast_fp16 = shape(x = dequantize_123)[name = string("op_100_shape_cast_fp16")];
            int32 gather_1_axis_0 = const()[name = string("gather_1_axis_0"), val = int32(0)];
            int32 gather_1_batch_dims_0 = const()[name = string("gather_1_batch_dims_0"), val = int32(0)];
            bool gather_1_validate_indices_0 = const()[name = string("gather_1_validate_indices_0"), val = bool(false)];
            string var_100_shape_cast_fp16_to_uint16_dtype_0 = const()[name = string("op_100_shape_cast_fp16_to_uint16_dtype_0"), val = string("uint16")];
            uint16 gather_1_indices_0_to_uint16 = const()[name = string("gather_1_indices_0_to_uint16"), val = uint16(0)];
            tensor<uint16, [3]> var_100_shape_cast_fp16_to_uint16 = cast(dtype = var_100_shape_cast_fp16_to_uint16_dtype_0, x = var_100_shape_cast_fp16)[name = string("cast_71")];
            uint16 gather_1_cast_uint16 = gather(axis = gather_1_axis_0, batch_dims = gather_1_batch_dims_0, indices = gather_1_indices_0_to_uint16, validate_indices = gather_1_validate_indices_0, x = var_100_shape_cast_fp16_to_uint16)[name = string("gather_1_cast_uint16")];
            string gather_1_cast_uint16_to_int32_dtype_0 = const()[name = string("gather_1_cast_uint16_to_int32_dtype_0"), val = string("int32")];
            int32 gather_2_axis_0 = const()[name = string("gather_2_axis_0"), val = int32(0)];
            int32 gather_2_batch_dims_0 = const()[name = string("gather_2_batch_dims_0"), val = int32(0)];
            bool gather_2_validate_indices_0 = const()[name = string("gather_2_validate_indices_0"), val = bool(false)];
            uint16 gather_2_indices_0_to_uint16 = const()[name = string("gather_2_indices_0_to_uint16"), val = uint16(1)];
            uint16 gather_2_cast_uint16 = gather(axis = gather_2_axis_0, batch_dims = gather_2_batch_dims_0, indices = gather_2_indices_0_to_uint16, validate_indices = gather_2_validate_indices_0, x = var_100_shape_cast_fp16_to_uint16)[name = string("gather_2_cast_uint16")];
            string gather_2_cast_uint16_to_int32_dtype_0 = const()[name = string("gather_2_cast_uint16_to_int32_dtype_0"), val = string("int32")];
            int32 concat_1_axis_0 = const()[name = string("concat_1_axis_0"), val = int32(0)];
            bool concat_1_interleave_0 = const()[name = string("concat_1_interleave_0"), val = bool(false)];
            int32 gather_2_cast_uint16_to_int32 = cast(dtype = gather_2_cast_uint16_to_int32_dtype_0, x = gather_2_cast_uint16)[name = string("cast_69")];
            int32 gather_1_cast_uint16_to_int32 = cast(dtype = gather_1_cast_uint16_to_int32_dtype_0, x = gather_1_cast_uint16)[name = string("cast_70")];
            tensor<int32, [4]> concat_1 = concat(axis = concat_1_axis_0, interleave = concat_1_interleave_0, values = (gather_1_cast_uint16_to_int32, gather_2_cast_uint16_to_int32, var_23, var_22))[name = string("concat_1")];
            tensor<fp16, [?, ?, 12, 32]> x_3_cast_fp16 = reshape(shape = concat_1, x = dequantize_123)[name = string("x_3_cast_fp16")];
            tensor<fp16, [384, 384]> model_encoder_layer_0_attention_self_value_weight_to_fp16_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12283200))), scale = tensor<fp16, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12430720))))[name = string("model_encoder_layer_0_attention_self_value_weight_to_fp16_quantized")];
            tensor<fp16, [384]> model_encoder_layer_0_attention_self_value_bias_to_fp16 = const()[name = string("model_encoder_layer_0_attention_self_value_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12431552)))];
            tensor<fp16, [?, ?, 384]> linear_2_cast_fp16 = linear(bias = model_encoder_layer_0_attention_self_value_bias_to_fp16, weight = model_encoder_layer_0_attention_self_value_weight_to_fp16_quantized, x = dequantize_4)[name = string("linear_2_cast_fp16")];
            fp16 quantize_80_scale_0 = const()[name = string("quantize_80_scale_0"), val = fp16(0x1.af4p-6)];
            string quantize_80_output_dtype_0 = const()[name = string("quantize_80_output_dtype_0"), val = string("int8")];
            tensor<int8, [?, ?, 384]> quantize_124 = quantize(input = linear_2_cast_fp16, output_dtype = quantize_80_output_dtype_0, scale = quantize_80_scale_0)[name = string("quantize_124")];
            fp16 dequantize_80_scale_0 = const()[name = string("dequantize_80_scale_0"), val = fp16(0x1.af4p-6)];
            tensor<fp16, [?, ?, 384]> dequantize_124 = dequantize(input = quantize_124, scale = dequantize_80_scale_0)[name = string("dequantize_124")];
            tensor<int32, [3]> var_109_shape_cast_fp16 = shape(x = dequantize_124)[name = string("op_109_shape_cast_fp16")];
            int32 gather_3_axis_0 = const()[name = string("gather_3_axis_0"), val = int32(0)];
            int32 gather_3_batch_dims_0 = const()[name = string("gather_3_batch_dims_0"), val = int32(0)];
            bool gather_3_validate_indices_0 = const()[name = string("gather_3_validate_indices_0"), val = bool(false)];
            string var_109_shape_cast_fp16_to_uint16_dtype_0 = const()[name = string("op_109_shape_cast_fp16_to_uint16_dtype_0"), val = string("uint16")];
            uint16 gather_3_indices_0_to_uint16 = const()[name = string("gather_3_indices_0_to_uint16"), val = uint16(0)];
            tensor<uint16, [3]> var_109_shape_cast_fp16_to_uint16 = cast(dtype = var_109_shape_cast_fp16_to_uint16_dtype_0, x = var_109_shape_cast_fp16)[name = string("cast_68")];
            uint16 gather_3_cast_uint16 = gather(axis = gather_3_axis_0, batch_dims = gather_3_batch_dims_0, indices = gather_3_indices_0_to_uint16, validate_indices = gather_3_validate_indices_0, x = var_109_shape_cast_fp16_to_uint16)[name = string("gather_3_cast_uint16")];
            string gather_3_cast_uint16_to_int32_dtype_0 = const()[name = string("gather_3_cast_uint16_to_int32_dtype_0"), val = string("int32")];
            int32 gather_4_axis_0 = const()[name = string("gather_4_axis_0"), val = int32(0)];
            int32 gather_4_batch_dims_0 = const()[name = string("gather_4_batch_dims_0"), val = int32(0)];
            bool gather_4_validate_indices_0 = const()[name = string("gather_4_validate_indices_0"), val = bool(false)];
            uint16 gather_4_indices_0_to_uint16 = const()[name = string("gather_4_indices_0_to_uint16"), val = uint16(1)];
            uint16 gather_4_cast_uint16 = gather(axis = gather_4_axis_0, batch_dims = gather_4_batch_dims_0, indices = gather_4_indices_0_to_uint16, validate_indices = gather_4_validate_indices_0, x = var_109_shape_cast_fp16_to_uint16)[name = string("gather_4_cast_uint16")];
            string gather_4_cast_uint16_to_int32_dtype_0 = const()[name = string("gather_4_cast_uint16_to_int32_dtype_0"), val = string("int32")];
            int32 concat_2_axis_0 = const()[name = string("concat_2_axis_0"), val = int32(0)];
            bool concat_2_interleave_0 = const()[name = string("concat_2_interleave_0"), val = bool(false)];
            int32 gather_4_cast_uint16_to_int32 = cast(dtype = gather_4_cast_uint16_to_int32_dtype_0, x = gather_4_cast_uint16)[name = string("cast_66")];
            int32 gather_3_cast_uint16_to_int32 = cast(dtype = gather_3_cast_uint16_to_int32_dtype_0, x = gather_3_cast_uint16)[name = string("cast_67")];
            tensor<int32, [4]> concat_2 = concat(axis = concat_2_axis_0, interleave = concat_2_interleave_0, values = (gather_3_cast_uint16_to_int32, gather_4_cast_uint16_to_int32, var_23, var_22))[name = string("concat_2")];
            tensor<fp16, [?, ?, 12, 32]> x_7_cast_fp16 = reshape(shape = concat_2, x = dequantize_124)[name = string("x_7_cast_fp16")];
            tensor<int32, [4]> var_113 = const()[name = string("op_113"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [3]> var_115_shape_cast_fp16 = shape(x = dequantize_122)[name = string("op_115_shape_cast_fp16")];
            int32 gather_5_axis_0 = const()[name = string("gather_5_axis_0"), val = int32(0)];
            int32 gather_5_batch_dims_0 = const()[name = string("gather_5_batch_dims_0"), val = int32(0)];
            bool gather_5_validate_indices_0 = const()[name = string("gather_5_validate_indices_0"), val = bool(false)];
            string var_115_shape_cast_fp16_to_uint16_dtype_0 = const()[name = string("op_115_shape_cast_fp16_to_uint16_dtype_0"), val = string("uint16")];
            uint16 gather_5_indices_0_to_uint16 = const()[name = string("gather_5_indices_0_to_uint16"), val = uint16(0)];
            tensor<uint16, [3]> var_115_shape_cast_fp16_to_uint16 = cast(dtype = var_115_shape_cast_fp16_to_uint16_dtype_0, x = var_115_shape_cast_fp16)[name = string("cast_65")];
            uint16 gather_5_cast_uint16 = gather(axis = gather_5_axis_0, batch_dims = gather_5_batch_dims_0, indices = gather_5_indices_0_to_uint16, validate_indices = gather_5_validate_indices_0, x = var_115_shape_cast_fp16_to_uint16)[name = string("gather_5_cast_uint16")];
            string gather_5_cast_uint16_to_int32_dtype_0 = const()[name = string("gather_5_cast_uint16_to_int32_dtype_0"), val = string("int32")];
            int32 gather_6_axis_0 = const()[name = string("gather_6_axis_0"), val = int32(0)];
            int32 gather_6_batch_dims_0 = const()[name = string("gather_6_batch_dims_0"), val = int32(0)];
            bool gather_6_validate_indices_0 = const()[name = string("gather_6_validate_indices_0"), val = bool(false)];
            uint16 gather_6_indices_0_to_uint16 = const()[name = string("gather_6_indices_0_to_uint16"), val = uint16(1)];
            uint16 gather_6_cast_uint16 = gather(axis = gather_6_axis_0, batch_dims = gather_6_batch_dims_0, indices = gather_6_indices_0_to_uint16, validate_indices = gather_6_validate_indices_0, x = var_115_shape_cast_fp16_to_uint16)[name = string("gather_6_cast_uint16")];
            string gather_6_cast_uint16_to_int32_dtype_0 = const()[name = string("gather_6_cast_uint16_to_int32_dtype_0"), val = string("int32")];
            int32 concat_3_axis_0 = const()[name = string("concat_3_axis_0"), val = int32(0)];
            bool concat_3_interleave_0 = const()[name = string("concat_3_interleave_0"), val = bool(false)];
            int32 gather_6_cast_uint16_to_int32 = cast(dtype = gather_6_cast_uint16_to_int32_dtype_0, x = gather_6_cast_uint16)[name = string("cast_63")];
            int32 gather_5_cast_uint16_to_int32 = cast(dtype = gather_5_cast_uint16_to_int32_dtype_0, x = gather_5_cast_uint16)[name = string("cast_64")];
            tensor<int32, [4]> concat_3 = concat(axis = concat_3_axis_0, interleave = concat_3_interleave_0, values = (gather_5_cast_uint16_to_int32, gather_6_cast_uint16_to_int32, var_23, var_22))[name = string("concat_3")];
            tensor<fp16, [?, ?, 12, 32]> x_11_cast_fp16 = reshape(shape = concat_3, x = dequantize_122)[name = string("x_11_cast_fp16")];
            bool attention_scores_1_transpose_x_0 = const()[name = string("attention_scores_1_transpose_x_0"), val = bool(false)];
            bool attention_scores_1_transpose_y_0 = const()[name = string("attention_scores_1_transpose_y_0"), val = bool(false)];
            tensor<int32, [4]> transpose_24_perm_0 = const()[name = string("transpose_24_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_25_perm_0 = const()[name = string("transpose_25_perm_0"), val = tensor<int32, [4]>([0, 2, -1, -3])];
            tensor<fp16, [?, 12, 32, ?]> transpose_25 = transpose(perm = transpose_25_perm_0, x = x_3_cast_fp16)[name = string("transpose_58")];
            tensor<fp16, [?, 12, ?, 32]> transpose_24 = transpose(perm = transpose_24_perm_0, x = x_11_cast_fp16)[name = string("transpose_59")];
            tensor<fp16, [?, 12, ?, ?]> attention_scores_1_cast_fp16 = matmul(transpose_x = attention_scores_1_transpose_x_0, transpose_y = attention_scores_1_transpose_y_0, x = transpose_24, y = transpose_25)[name = string("attention_scores_1_cast_fp16")];
            fp16 _inversed_attention_scores_3_y_0_to_fp16 = const()[name = string("_inversed_attention_scores_3_y_0_to_fp16"), val = fp16(0x1.6ap-3)];
            tensor<fp16, [?, 12, ?, ?]> _inversed_attention_scores_3_cast_fp16 = mul(x = attention_scores_1_cast_fp16, y = _inversed_attention_scores_3_y_0_to_fp16)[name = string("_inversed_attention_scores_3_cast_fp16")];
            fp16 quantize_7_scale_0 = const()[name = string("quantize_7_scale_0"), val = fp16(0x1.2ecp+0)];
            string quantize_7_output_dtype_0 = const()[name = string("quantize_7_output_dtype_0"), val = string("int8")];
            tensor<int8, [?, 12, ?, ?]> quantize_7 = quantize(input = _inversed_attention_scores_3_cast_fp16, output_dtype = quantize_7_output_dtype_0, scale = quantize_7_scale_0)[name = string("quantize_7")];
            fp16 quantize_8_scale_0 = const()[name = string("quantize_8_scale_0"), val = fp16(nan)];
            string quantize_8_output_dtype_0 = const()[name = string("quantize_8_output_dtype_0"), val = string("int8")];
            tensor<int8, [?, 1, 1, ?]> quantize_8 = quantize(input = attention_mask_cast_fp16, output_dtype = quantize_8_output_dtype_0, scale = quantize_8_scale_0)[name = string("quantize_8")];
            fp16 dequantize_170_scale_0 = const()[name = string("dequantize_170_scale_0"), val = fp16(0x1p+0)];
            tensor<fp16, [?, 1, 1, ?]> dequantize_170 = dequantize(input = quantize_8, scale = dequantize_170_scale_0)[name = string("dequantize_170")];
            fp16 dequantize_4_scale_0_1 = const()[name = string("dequantize_4_scale_0_1"), val = fp16(nan)];
            tensor<fp16, [?, 12, ?, ?]> dequantize_4_1 = dequantize(input = quantize_7, scale = dequantize_4_scale_0_1)[name = string("dequantize_4_1")];
            tensor<fp16, [?, 12, ?, ?]> input_11_cast_fp16 = add(x = dequantize_4_1, y = dequantize_170)[name = string("input_11_cast_fp16")];
            string quantize_81_output_dtype_0 = const()[name = string("quantize_81_output_dtype_0"), val = string("int8")];
            fp16 quantize_2_scale_0 = const()[name = string("quantize_2_scale_0"), val = fp16(nan)];
            tensor<int8, [?, 12, ?, ?]> quantize_2 = quantize(input = input_11_cast_fp16, output_dtype = quantize_81_output_dtype_0, scale = quantize_2_scale_0)[name = string("quantize_2")];
            fp16 dequantize_81_scale_0 = const()[name = string("dequantize_81_scale_0"), val = fp16(nan)];
            tensor<fp16, [?, 12, ?, ?]> dequantize_125 = dequantize(input = quantize_2, scale = dequantize_81_scale_0)[name = string("dequantize_125")];
            tensor<fp16, [?, 12, ?, ?]> input_13_cast_fp16 = softmax(axis = var_24, x = dequantize_125)[name = string("input_13_cast_fp16")];
            bool context_layer_1_transpose_x_0 = const()[name = string("context_layer_1_transpose_x_0"), val = bool(false)];
            bool context_layer_1_transpose_y_0 = const()[name = string("context_layer_1_transpose_y_0"), val = bool(false)];
            tensor<fp16, [?, 12, ?, 32]> value_layer_1_cast_fp16 = transpose(perm = var_113, x = x_7_cast_fp16)[name = string("transpose_57")];
            tensor<fp16, [?, 12, ?, 32]> context_layer_1_cast_fp16 = matmul(transpose_x = context_layer_1_transpose_x_0, transpose_y = context_layer_1_transpose_y_0, x = input_13_cast_fp16, y = value_layer_1_cast_fp16)[name = string("context_layer_1_cast_fp16")];
            tensor<int32, [4]> var_129 = const()[name = string("op_129"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [?, ?, 12, 32]> var_130_cast_fp16 = transpose(perm = var_129, x = context_layer_1_cast_fp16)[name = string("transpose_56")];
            tensor<int32, [4]> var_132_shape_cast_fp16 = shape(x = var_130_cast_fp16)[name = string("op_132_shape_cast_fp16")];
            int32 gather_7_axis_0 = const()[name = string("gather_7_axis_0"), val = int32(0)];
            int32 gather_7_batch_dims_0 = const()[name = string("gather_7_batch_dims_0"), val = int32(0)];
            bool gather_7_validate_indices_0 = const()[name = string("gather_7_validate_indices_0"), val = bool(false)];
            string var_132_shape_cast_fp16_to_uint16_dtype_0 = const()[name = string("op_132_shape_cast_fp16_to_uint16_dtype_0"), val = string("uint16")];
            uint16 gather_7_indices_0_to_uint16 = const()[name = string("gather_7_indices_0_to_uint16"), val = uint16(0)];
            tensor<uint16, [4]> var_132_shape_cast_fp16_to_uint16 = cast(dtype = var_132_shape_cast_fp16_to_uint16_dtype_0, x = var_132_shape_cast_fp16)[name = string("cast_62")];
            uint16 gather_7_cast_uint16 = gather(axis = gather_7_axis_0, batch_dims = gather_7_batch_dims_0, indices = gather_7_indices_0_to_uint16, validate_indices = gather_7_validate_indices_0, x = var_132_shape_cast_fp16_to_uint16)[name = string("gather_7_cast_uint16")];
            string gather_7_cast_uint16_to_int32_dtype_0 = const()[name = string("gather_7_cast_uint16_to_int32_dtype_0"), val = string("int32")];
            int32 gather_8_axis_0 = const()[name = string("gather_8_axis_0"), val = int32(0)];
            int32 gather_8_batch_dims_0 = const()[name = string("gather_8_batch_dims_0"), val = int32(0)];
            bool gather_8_validate_indices_0 = const()[name = string("gather_8_validate_indices_0"), val = bool(false)];
            uint16 gather_8_indices_0_to_uint16 = const()[name = string("gather_8_indices_0_to_uint16"), val = uint16(1)];
            uint16 gather_8_cast_uint16 = gather(axis = gather_8_axis_0, batch_dims = gather_8_batch_dims_0, indices = gather_8_indices_0_to_uint16, validate_indices = gather_8_validate_indices_0, x = var_132_shape_cast_fp16_to_uint16)[name = string("gather_8_cast_uint16")];
            string gather_8_cast_uint16_to_int32_dtype_0 = const()[name = string("gather_8_cast_uint16_to_int32_dtype_0"), val = string("int32")];
            int32 concat_4_axis_0 = const()[name = string("concat_4_axis_0"), val = int32(0)];
            bool concat_4_interleave_0 = const()[name = string("concat_4_interleave_0"), val = bool(false)];
            int32 gather_8_cast_uint16_to_int32 = cast(dtype = gather_8_cast_uint16_to_int32_dtype_0, x = gather_8_cast_uint16)[name = string("cast_60")];
            int32 gather_7_cast_uint16_to_int32 = cast(dtype = gather_7_cast_uint16_to_int32_dtype_0, x = gather_7_cast_uint16)[name = string("cast_61")];
            tensor<int32, [3]> concat_4 = concat(axis = concat_4_axis_0, interleave = concat_4_interleave_0, values = (gather_7_cast_uint16_to_int32, gather_8_cast_uint16_to_int32, var_27))[name = string("concat_4")];
            tensor<fp16, [?, ?, 384]> input_15_cast_fp16 = reshape(shape = concat_4, x = var_130_cast_fp16)[name = string("input_15_cast_fp16")];
            tensor<fp16, [384, 384]> model_encoder_layer_0_attention_output_dense_weight_to_fp16_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12432384))), scale = tensor<fp16, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12579904))))[name = string("model_encoder_layer_0_attention_output_dense_weight_to_fp16_quantized")];
            tensor<fp16, [384]> model_encoder_layer_0_attention_output_dense_bias_to_fp16 = const()[name = string("model_encoder_layer_0_attention_output_dense_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12580736)))];
            fp16 quantize_9_scale_0 = const()[name = string("quantize_9_scale_0"), val = fp16(nan)];
            string quantize_9_output_dtype_0 = const()[name = string("quantize_9_output_dtype_0"), val = string("int8")];
            tensor<int8, [?, ?, 384]> quantize_9 = quantize(input = input_15_cast_fp16, output_dtype = quantize_9_output_dtype_0, scale = quantize_9_scale_0)[name = string("quantize_9")];
            fp16 dequantize_9_scale_0 = const()[name = string("dequantize_9_scale_0"), val = fp16(nan)];
            tensor<fp16, [?, ?, 384]> dequantize_9 = dequantize(input = quantize_9, scale = dequantize_9_scale_0)[name = string("dequantize_9")];
            tensor<fp16, [?, ?, 384]> linear_3_cast_fp16 = linear(bias = model_encoder_layer_0_attention_output_dense_bias_to_fp16, weight = model_encoder_layer_0_attention_output_dense_weight_to_fp16_quantized, x = dequantize_9)[name = string("linear_3_cast_fp16")];
            fp16 quantize_10_scale_0 = const()[name = string("quantize_10_scale_0"), val = fp16(nan)];
            string quantize_10_output_dtype_0 = const()[name = string("quantize_10_output_dtype_0"), val = string("int8")];
            tensor<int8, [?, ?, 384]> quantize_10 = quantize(input = linear_3_cast_fp16, output_dtype = quantize_10_output_dtype_0, scale = quantize_10_scale_0)[name = string("quantize_10")];
            fp16 dequantize_172_scale_0 = const()[name = string("dequantize_172_scale_0"), val = fp16(0x1p+0)];
            tensor<fp16, [?, ?, 384]> dequantize_172 = dequantize(input = quantize_4, scale = dequantize_172_scale_0)[name = string("dequantize_172")];
            fp16 dequantize_6_scale_0 = const()[name = string("dequantize_6_scale_0"), val = fp16(nan)];
            tensor<fp16, [?, ?, 384]> dequantize_6 = dequantize(input = quantize_10, scale = dequantize_6_scale_0)[name = string("dequantize_6")];
            tensor<fp16, [?, ?, 384]> input_19_cast_fp16 = add(x = dequantize_6, y = dequantize_172)[name = string("input_19_cast_fp16")];
            string quantize_82_output_dtype_0 = const()[name = string("quantize_82_output_dtype_0"), val = string("int8")];
            fp16 quantize_3_scale_0_1 = const()[name = string("quantize_3_scale_0_1"), val = fp16(nan)];
            tensor<int8, [?, ?, 384]> quantize_3_1 = quantize(input = input_19_cast_fp16, output_dtype = quantize_82_output_dtype_0, scale = quantize_3_scale_0_1)[name = string("quantize_3_1")];
            fp16 dequantize_82_scale_0 = const()[name = string("dequantize_82_scale_0"), val = fp16(nan)];
            tensor<fp16, [?, ?, 384]> dequantize_126 = dequantize(input = quantize_3_1, scale = dequantize_82_scale_0)[name = string("dequantize_126")];
            tensor<int32, [1]> input_21_axes_0 = const()[name = string("input_21_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> model_encoder_layer_0_attention_output_LayerNorm_weight_to_fp16 = const()[name = string("model_encoder_layer_0_attention_output_LayerNorm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12581568)))];
            tensor<fp16, [384]> model_encoder_layer_0_attention_output_LayerNorm_bias_to_fp16 = const()[name = string("model_encoder_layer_0_attention_output_LayerNorm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12582400)))];
            tensor<fp16, [?, ?, 384]> input_21_cast_fp16 = layer_norm(axes = input_21_axes_0, beta = model_encoder_layer_0_attention_output_LayerNorm_bias_to_fp16, epsilon = var_26_to_fp16, gamma = model_encoder_layer_0_attention_output_LayerNorm_weight_to_fp16, x = dequantize_126)[name = string("input_21_cast_fp16")];
            tensor<fp16, [1536, 384]> model_encoder_layer_0_intermediate_dense_weight_to_fp16_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [1536, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12583232))), scale = tensor<fp16, [1536, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(13173120))))[name = string("model_encoder_layer_0_intermediate_dense_weight_to_fp16_quantized")];
            tensor<fp16, [1536]> model_encoder_layer_0_intermediate_dense_bias_to_fp16 = const()[name = string("model_encoder_layer_0_intermediate_dense_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(13176256)))];
            fp16 quantize_12_scale_0 = const()[name = string("quantize_12_scale_0"), val = fp16(nan)];
            string quantize_12_output_dtype_0 = const()[name = string("quantize_12_output_dtype_0"), val = string("int8")];
            tensor<int8, [?, ?, 384]> quantize_12 = quantize(input = input_21_cast_fp16, output_dtype = quantize_12_output_dtype_0, scale = quantize_12_scale_0)[name = string("quantize_12")];
            fp16 dequantize_12_scale_0 = const()[name = string("dequantize_12_scale_0"), val = fp16(nan)];
            tensor<fp16, [?, ?, 384]> dequantize_12 = dequantize(input = quantize_12, scale = dequantize_12_scale_0)[name = string("dequantize_12")];
            tensor<fp16, [?, ?, 1536]> linear_4_cast_fp16 = linear(bias = model_encoder_layer_0_intermediate_dense_bias_to_fp16, weight = model_encoder_layer_0_intermediate_dense_weight_to_fp16_quantized, x = dequantize_12)[name = string("linear_4_cast_fp16")];
            fp16 quantize_83_scale_0 = const()[name = string("quantize_83_scale_0"), val = fp16(nan)];
            string quantize_83_output_dtype_0 = const()[name = string("quantize_83_output_dtype_0"), val = string("int8")];
            tensor<int8, [?, ?, 1536]> quantize_127 = quantize(input = linear_4_cast_fp16, output_dtype = quantize_83_output_dtype_0, scale = quantize_83_scale_0)[name = string("quantize_127")];
            fp16 dequantize_83_scale_0 = const()[name = string("dequantize_83_scale_0"), val = fp16(nan)];
            tensor<fp16, [?, ?, 1536]> dequantize_127 = dequantize(input = quantize_127, scale = dequantize_83_scale_0)[name = string("dequantize_127")];
            string input_25_mode_0 = const()[name = string("input_25_mode_0"), val = string("EXACT")];
            tensor<fp16, [?, ?, 1536]> input_25_cast_fp16 = gelu(mode = input_25_mode_0, x = dequantize_127)[name = string("input_25_cast_fp16")];
            tensor<fp16, [384, 1536]> model_encoder_layer_0_output_dense_weight_to_fp16_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 1536]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(13179392))), scale = tensor<fp16, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(13769280))))[name = string("model_encoder_layer_0_output_dense_weight_to_fp16_quantized")];
            tensor<fp16, [384]> model_encoder_layer_0_output_dense_bias_to_fp16 = const()[name = string("model_encoder_layer_0_output_dense_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(13770112)))];
            fp16 quantize_13_scale_0 = const()[name = string("quantize_13_scale_0"), val = fp16(nan)];
            string quantize_13_output_dtype_0 = const()[name = string("quantize_13_output_dtype_0"), val = string("int8")];
            tensor<int8, [?, ?, 1536]> quantize_13 = quantize(input = input_25_cast_fp16, output_dtype = quantize_13_output_dtype_0, scale = quantize_13_scale_0)[name = string("quantize_13")];
            fp16 dequantize_13_scale_0 = const()[name = string("dequantize_13_scale_0"), val = fp16(nan)];
            tensor<fp16, [?, ?, 1536]> dequantize_13 = dequantize(input = quantize_13, scale = dequantize_13_scale_0)[name = string("dequantize_13")];
            tensor<fp16, [?, ?, 384]> linear_5_cast_fp16 = linear(bias = model_encoder_layer_0_output_dense_bias_to_fp16, weight = model_encoder_layer_0_output_dense_weight_to_fp16_quantized, x = dequantize_13)[name = string("linear_5_cast_fp16")];
            fp16 quantize_14_scale_0 = const()[name = string("quantize_14_scale_0"), val = fp16(nan)];
            string quantize_14_output_dtype_0 = const()[name = string("quantize_14_output_dtype_0"), val = string("int8")];
            tensor<int8, [?, ?, 384]> quantize_14 = quantize(input = linear_5_cast_fp16, output_dtype = quantize_14_output_dtype_0, scale = quantize_14_scale_0)[name = string("quantize_14")];
            fp16 quantize_15_scale_0 = const()[name = string("quantize_15_scale_0"), val = fp16(nan)];
            string quantize_15_output_dtype_0 = const()[name = string("quantize_15_output_dtype_0"), val = string("int8")];
            tensor<int8, [?, ?, 384]> quantize_15 = quantize(input = input_21_cast_fp16, output_dtype = quantize_15_output_dtype_0, scale = quantize_15_scale_0)[name = string("quantize_15")];
            fp16 dequantize_174_scale_0 = const()[name = string("dequantize_174_scale_0"), val = fp16(0x1p+0)];
            tensor<fp16, [?, ?, 384]> dequantize_174 = dequantize(input = quantize_15, scale = dequantize_174_scale_0)[name = string("dequantize_174")];
            fp16 dequantize_8_scale_0 = const()[name = string("dequantize_8_scale_0"), val = fp16(nan)];
            tensor<fp16, [?, ?, 384]> dequantize_8 = dequantize(input = quantize_14, scale = dequantize_8_scale_0)[name = string("dequantize_8")];
            tensor<fp16, [?, ?, 384]> input_29_cast_fp16 = add(x = dequantize_8, y = dequantize_174)[name = string("input_29_cast_fp16")];
            string quantize_84_output_dtype_0 = const()[name = string("quantize_84_output_dtype_0"), val = string("int8")];
            fp16 quantize_4_scale_0_1 = const()[name = string("quantize_4_scale_0_1"), val = fp16(nan)];
            tensor<int8, [?, ?, 384]> quantize_4_1 = quantize(input = input_29_cast_fp16, output_dtype = quantize_84_output_dtype_0, scale = quantize_4_scale_0_1)[name = string("quantize_4_1")];
            fp16 dequantize_84_scale_0 = const()[name = string("dequantize_84_scale_0"), val = fp16(nan)];
            tensor<fp16, [?, ?, 384]> dequantize_128 = dequantize(input = quantize_4_1, scale = dequantize_84_scale_0)[name = string("dequantize_128")];
            tensor<int32, [1]> input_31_axes_0 = const()[name = string("input_31_axes_0"), val = tensor<int32, [1]>([-1])];
