program(1.3)
[buildInfo = dict<string, string>({{"coremlc-component-MIL", "3500.14.1"}, {"coremlc-version", "3500.32.1"}, {"coremltools-component-torch", "2.7.1"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0"}})]
{
    func main<ios18>(tensor<int32, [?, ?]> attention_mask, tensor<int32, [?, ?]> input_ids) [FlexibleShapeInformation = tuple<tuple<string, dict<string, tensor<int32, [?]>>>, tuple<string, dict<string, dict<string, tensor<int32, [?]>>>>>((("DefaultShapes", {{"attention_mask", [1, 32]}, {"input_ids", [1, 32]}}), ("EnumeratedShapes", {{"000187c4", {{"attention_mask", [64, 64]}, {"input_ids", [64, 64]}}}, {"090f2853", {{"attention_mask", [1, 128]}, {"input_ids", [1, 128]}}}, {"0a731900", {{"attention_mask", [1, 256]}, {"input_ids", [1, 256]}}}, {"14e22cc3", {{"attention_mask", [8, 64]}, {"input_ids", [8, 64]}}}, {"155d1fbb", {{"attention_mask", [64, 384]}, {"input_ids", [64, 384]}}}, {"1a2a12fc", {{"attention_mask", [16, 512]}, {"input_ids", [16, 512]}}}, {"22c267bf", {{"attention_mask", [64, 128]}, {"input_ids", [64, 128]}}}, {"24cf7ddf", {{"attention_mask", [64, 32]}, {"input_ids", [64, 32]}}}, {"2721a294", {{"attention_mask", [16, 32]}, {"input_ids", [16, 32]}}}, {"29d5bec5", {{"attention_mask", [32, 256]}, {"input_ids", [32, 256]}}}, {"3a8c1bc2", {{"attention_mask", [32, 512]}, {"input_ids", [32, 512]}}}, {"4b9590f0", {{"attention_mask", [16, 256]}, {"input_ids", [16, 256]}}}, {"50450b3e", {{"attention_mask", [16, 128]}, {"input_ids", [16, 128]}}}, {"517b156a", {{"attention_mask", [8, 512]}, {"input_ids", [8, 512]}}}, {"53dd2036", {{"attention_mask", [32, 384]}, {"input_ids", [32, 384]}}}, {"6526d012", {{"attention_mask", [8, 32]}, {"input_ids", [8, 32]}}}, {"7b263bfe", {{"attention_mask", [1, 512]}, {"input_ids", [1, 512]}}}, {"89020357", {{"attention_mask", [32, 128]}, {"input_ids", [32, 128]}}}, {"92e182a7", {{"attention_mask", [1, 384]}, {"input_ids", [1, 384]}}}, {"964b98d6", {{"attention_mask", [64, 512]}, {"input_ids", [64, 512]}}}, {"a28995a1", {{"attention_mask", [16, 64]}, {"input_ids", [16, 64]}}}, {"a4e8f51c", {{"attention_mask", [32, 32]}, {"input_ids", [32, 32]}}}, {"aa3a1438", {{"attention_mask", [8, 128]}, {"input_ids", [8, 128]}}}, {"b0234bc7", {{"attention_mask", [8, 384]}, {"input_ids", [8, 384]}}}, {"ba32981e", {{"attention_mask", [16, 384]}, {"input_ids", [16, 384]}}}, {"cc37bcd3", {{"attention_mask", [8, 256]}, {"input_ids", [8, 256]}}}, {"d2679837", {{"attention_mask", [64, 256]}, {"input_ids", [64, 256]}}}, {"d8f542e5", {{"attention_mask", [1, 64]}, {"input_ids", [1, 64]}}}, {"e78bf925", {{"attention_mask", [32, 64]}, {"input_ids", [32, 64]}}}, {"f5a604ed", {{"attention_mask", [1, 32]}, {"input_ids", [1, 32]}}}})))] {
            tensor<int32, [1, 512]> model_embeddings_position_ids = const()[name = string("model_embeddings_position_ids"), val = tensor<int32, [1, 512]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(64)))];
            tensor<int32, [?, ?]> input_1 = sub(x = input_ids, y = input_ids)[name = string("sub_0")];
            int32 var_22 = const()[name = string("op_22"), val = int32(32)];
            int32 var_23 = const()[name = string("op_23"), val = int32(12)];
            int32 var_24 = const()[name = string("op_24"), val = int32(-1)];
            int32 var_27 = const()[name = string("op_27"), val = int32(384)];
            tensor<int32, [1]> var_42_axes_0 = const()[name = string("op_42_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [?, 1, ?]> var_42 = expand_dims(axes = var_42_axes_0, x = attention_mask)[name = string("op_42")];
            tensor<int32, [1]> var_43_axes_0 = const()[name = string("op_43_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<int32, [?, 1, 1, ?]> var_43 = expand_dims(axes = var_43_axes_0, x = var_42)[name = string("op_43")];
            fp16 var_29_to_fp16 = const()[name = string("op_29_to_fp16"), val = fp16(0x1p+0)];
            string var_45_to_fp16_dtype_0 = const()[name = string("op_45_to_fp16_dtype_0"), val = string("fp16")];
            tensor<fp16, [?, 1, 1, ?]> var_43_to_fp16 = cast(dtype = var_45_to_fp16_dtype_0, x = var_43)[name = string("cast_117")];
            tensor<fp16, [?, 1, 1, ?]> var_46_cast_fp16 = sub(x = var_29_to_fp16, y = var_43_to_fp16)[name = string("op_46_cast_fp16")];
            fp16 var_47_to_fp16 = const()[name = string("op_47_to_fp16"), val = fp16(-inf)];
            tensor<fp16, [?, 1, 1, ?]> attention_mask_cast_fp16 = mul(x = var_46_cast_fp16, y = var_47_to_fp16)[name = string("attention_mask_cast_fp16")];
            tensor<int32, [2]> var_54_shape = shape(x = input_ids)[name = string("op_54_shape")];
            int32 gather_0_axis_0 = const()[name = string("gather_0_axis_0"), val = int32(0)];
            int32 gather_0_batch_dims_0 = const()[name = string("gather_0_batch_dims_0"), val = int32(0)];
            bool gather_0_validate_indices_0 = const()[name = string("gather_0_validate_indices_0"), val = bool(false)];
            string var_54_shape_to_int16_dtype_0 = const()[name = string("op_54_shape_to_int16_dtype_0"), val = string("int16")];
            uint16 gather_0_indices_0_to_uint16 = const()[name = string("gather_0_indices_0_to_uint16"), val = uint16(1)];
            tensor<int16, [2]> var_54_shape_to_int16 = cast(dtype = var_54_shape_to_int16_dtype_0, x = var_54_shape)[name = string("cast_116")];
            int16 gather_0_cast_uint16 = gather(axis = gather_0_axis_0, batch_dims = gather_0_batch_dims_0, indices = gather_0_indices_0_to_uint16, validate_indices = gather_0_validate_indices_0, x = var_54_shape_to_int16)[name = string("gather_0_cast_uint16")];
            string gather_0_cast_uint16_to_int32_dtype_0 = const()[name = string("gather_0_cast_uint16_to_int32_dtype_0"), val = string("int32")];
            int32 concat_0_values0_0 = const()[name = string("concat_0_values0_0"), val = int32(1)];
            int32 concat_0_axis_0 = const()[name = string("concat_0_axis_0"), val = int32(0)];
            bool concat_0_interleave_0 = const()[name = string("concat_0_interleave_0"), val = bool(false)];
            int32 gather_0_cast_uint16_to_int32 = cast(dtype = gather_0_cast_uint16_to_int32_dtype_0, x = gather_0_cast_uint16)[name = string("cast_115")];
            tensor<int32, [2]> concat_0 = concat(axis = concat_0_axis_0, interleave = concat_0_interleave_0, values = (concat_0_values0_0, gather_0_cast_uint16_to_int32))[name = string("concat_0")];
            tensor<int32, [2]> input_3_begin_0 = const()[name = string("input_3_begin_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<bool, [2]> input_3_end_mask_0 = const()[name = string("input_3_end_mask_0"), val = tensor<bool, [2]>([true, false])];
            tensor<int32, [1, ?]> input_3 = slice_by_index(begin = input_3_begin_0, end = concat_0, end_mask = input_3_end_mask_0, x = model_embeddings_position_ids)[name = string("input_3")];
            int32 inputs_embeds_axis_0 = const()[name = string("inputs_embeds_axis_0"), val = int32(0)];
            int32 inputs_embeds_batch_dims_0 = const()[name = string("inputs_embeds_batch_dims_0"), val = int32(0)];
            bool inputs_embeds_validate_indices_0 = const()[name = string("inputs_embeds_validate_indices_0"), val = bool(false)];
            tensor<fp16, [30522, 384]> model_embeddings_word_embeddings_weight_to_fp16 = const()[name = string("model_embeddings_word_embeddings_weight_to_fp16"), val = tensor<fp16, [30522, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2176)))];
            string input_ids_to_uint16_dtype_0 = const()[name = string("input_ids_to_uint16_dtype_0"), val = string("uint16")];
            tensor<uint16, [?, ?]> input_ids_to_uint16 = cast(dtype = input_ids_to_uint16_dtype_0, x = input_ids)[name = string("cast_114")];
            tensor<fp16, [?, ?, 384]> inputs_embeds_cast_fp16_cast_uint16 = gather(axis = inputs_embeds_axis_0, batch_dims = inputs_embeds_batch_dims_0, indices = input_ids_to_uint16, validate_indices = inputs_embeds_validate_indices_0, x = model_embeddings_word_embeddings_weight_to_fp16)[name = string("inputs_embeds_cast_fp16_cast_uint16")];
            int32 token_type_embeddings_1_axis_0 = const()[name = string("token_type_embeddings_1_axis_0"), val = int32(0)];
            int32 token_type_embeddings_1_batch_dims_0 = const()[name = string("token_type_embeddings_1_batch_dims_0"), val = int32(0)];
            bool token_type_embeddings_1_validate_indices_0 = const()[name = string("token_type_embeddings_1_validate_indices_0"), val = bool(false)];
            tensor<fp16, [2, 384]> model_embeddings_token_type_embeddings_weight_to_fp16 = const()[name = string("model_embeddings_token_type_embeddings_weight_to_fp16"), val = tensor<fp16, [2, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(23443136)))];
            string input_1_to_uint16_dtype_0 = const()[name = string("input_1_to_uint16_dtype_0"), val = string("uint16")];
            tensor<uint16, [?, ?]> input_1_to_uint16 = cast(dtype = input_1_to_uint16_dtype_0, x = input_1)[name = string("cast_113")];
            tensor<fp16, [?, ?, 384]> token_type_embeddings_1_cast_fp16_cast_uint16 = gather(axis = token_type_embeddings_1_axis_0, batch_dims = token_type_embeddings_1_batch_dims_0, indices = input_1_to_uint16, validate_indices = token_type_embeddings_1_validate_indices_0, x = model_embeddings_token_type_embeddings_weight_to_fp16)[name = string("token_type_embeddings_1_cast_fp16_cast_uint16")];
            tensor<fp16, [?, ?, 384]> embeddings_1_cast_fp16 = add(x = inputs_embeds_cast_fp16_cast_uint16, y = token_type_embeddings_1_cast_fp16_cast_uint16)[name = string("embeddings_1_cast_fp16")];
            int32 position_embeddings_1_axis_0 = const()[name = string("position_embeddings_1_axis_0"), val = int32(0)];
            int32 position_embeddings_1_batch_dims_0 = const()[name = string("position_embeddings_1_batch_dims_0"), val = int32(0)];
            bool position_embeddings_1_validate_indices_0 = const()[name = string("position_embeddings_1_validate_indices_0"), val = bool(false)];
            tensor<fp16, [512, 384]> model_embeddings_position_embeddings_weight_to_fp16 = const()[name = string("model_embeddings_position_embeddings_weight_to_fp16"), val = tensor<fp16, [512, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(23444736)))];
            string input_3_to_uint16_dtype_0 = const()[name = string("input_3_to_uint16_dtype_0"), val = string("uint16")];
            tensor<uint16, [1, ?]> input_3_to_uint16 = cast(dtype = input_3_to_uint16_dtype_0, x = input_3)[name = string("cast_112")];
            tensor<fp16, [1, ?, 384]> position_embeddings_1_cast_fp16_cast_uint16 = gather(axis = position_embeddings_1_axis_0, batch_dims = position_embeddings_1_batch_dims_0, indices = input_3_to_uint16, validate_indices = position_embeddings_1_validate_indices_0, x = model_embeddings_position_embeddings_weight_to_fp16)[name = string("position_embeddings_1_cast_fp16_cast_uint16")];
            tensor<fp16, [?, ?, 384]> input_5_cast_fp16 = add(x = embeddings_1_cast_fp16, y = position_embeddings_1_cast_fp16_cast_uint16)[name = string("input_5_cast_fp16")];
            tensor<int32, [1]> input_7_axes_0 = const()[name = string("input_7_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> model_embeddings_LayerNorm_weight_to_fp16 = const()[name = string("model_embeddings_LayerNorm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(23838016)))];
            tensor<fp16, [384]> model_embeddings_LayerNorm_bias_to_fp16 = const()[name = string("model_embeddings_LayerNorm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(23838848)))];
            fp16 var_26_to_fp16 = const()[name = string("op_26_to_fp16"), val = fp16(0x1p-24)];
            tensor<fp16, [?, ?, 384]> input_7_cast_fp16 = layer_norm(axes = input_7_axes_0, beta = model_embeddings_LayerNorm_bias_to_fp16, epsilon = var_26_to_fp16, gamma = model_embeddings_LayerNorm_weight_to_fp16, x = input_5_cast_fp16)[name = string("input_7_cast_fp16")];
            tensor<fp16, [384, 384]> model_encoder_layer_0_attention_self_query_weight_to_fp16 = const()[name = string("model_encoder_layer_0_attention_self_query_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(23839680)))];
            tensor<fp16, [384]> model_encoder_layer_0_attention_self_query_bias_to_fp16 = const()[name = string("model_encoder_layer_0_attention_self_query_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(24134656)))];
            tensor<fp16, [?, ?, 384]> linear_0_cast_fp16 = linear(bias = model_encoder_layer_0_attention_self_query_bias_to_fp16, weight = model_encoder_layer_0_attention_self_query_weight_to_fp16, x = input_7_cast_fp16)[name = string("linear_0_cast_fp16")];
            tensor<fp16, [384, 384]> model_encoder_layer_0_attention_self_key_weight_to_fp16 = const()[name = string("model_encoder_layer_0_attention_self_key_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(24135488)))];
            tensor<fp16, [384]> model_encoder_layer_0_attention_self_key_bias_to_fp16 = const()[name = string("model_encoder_layer_0_attention_self_key_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(24430464)))];
            tensor<fp16, [?, ?, 384]> linear_1_cast_fp16 = linear(bias = model_encoder_layer_0_attention_self_key_bias_to_fp16, weight = model_encoder_layer_0_attention_self_key_weight_to_fp16, x = input_7_cast_fp16)[name = string("linear_1_cast_fp16")];
            tensor<int32, [3]> var_100_shape_cast_fp16 = shape(x = linear_1_cast_fp16)[name = string("op_100_shape_cast_fp16")];
            int32 gather_1_axis_0 = const()[name = string("gather_1_axis_0"), val = int32(0)];
            int32 gather_1_batch_dims_0 = const()[name = string("gather_1_batch_dims_0"), val = int32(0)];
            bool gather_1_validate_indices_0 = const()[name = string("gather_1_validate_indices_0"), val = bool(false)];
            string var_100_shape_cast_fp16_to_uint16_dtype_0 = const()[name = string("op_100_shape_cast_fp16_to_uint16_dtype_0"), val = string("uint16")];
            uint16 gather_1_indices_0_to_uint16 = const()[name = string("gather_1_indices_0_to_uint16"), val = uint16(0)];
            tensor<uint16, [3]> var_100_shape_cast_fp16_to_uint16 = cast(dtype = var_100_shape_cast_fp16_to_uint16_dtype_0, x = var_100_shape_cast_fp16)[name = string("cast_111")];
            uint16 gather_1_cast_uint16 = gather(axis = gather_1_axis_0, batch_dims = gather_1_batch_dims_0, indices = gather_1_indices_0_to_uint16, validate_indices = gather_1_validate_indices_0, x = var_100_shape_cast_fp16_to_uint16)[name = string("gather_1_cast_uint16")];
            string gather_1_cast_uint16_to_int32_dtype_0 = const()[name = string("gather_1_cast_uint16_to_int32_dtype_0"), val = string("int32")];
            int32 gather_2_axis_0 = const()[name = string("gather_2_axis_0"), val = int32(0)];
            int32 gather_2_batch_dims_0 = const()[name = string("gather_2_batch_dims_0"), val = int32(0)];
            bool gather_2_validate_indices_0 = const()[name = string("gather_2_validate_indices_0"), val = bool(false)];
            uint16 gather_2_indices_0_to_uint16 = const()[name = string("gather_2_indices_0_to_uint16"), val = uint16(1)];
            uint16 gather_2_cast_uint16 = gather(axis = gather_2_axis_0, batch_dims = gather_2_batch_dims_0, indices = gather_2_indices_0_to_uint16, validate_indices = gather_2_validate_indices_0, x = var_100_shape_cast_fp16_to_uint16)[name = string("gather_2_cast_uint16")];
            string gather_2_cast_uint16_to_int32_dtype_0 = const()[name = string("gather_2_cast_uint16_to_int32_dtype_0"), val = string("int32")];
            int32 concat_1_axis_0 = const()[name = string("concat_1_axis_0"), val = int32(0)];
            bool concat_1_interleave_0 = const()[name = string("concat_1_interleave_0"), val = bool(false)];
            int32 gather_2_cast_uint16_to_int32 = cast(dtype = gather_2_cast_uint16_to_int32_dtype_0, x = gather_2_cast_uint16)[name = string("cast_109")];
            int32 gather_1_cast_uint16_to_int32 = cast(dtype = gather_1_cast_uint16_to_int32_dtype_0, x = gather_1_cast_uint16)[name = string("cast_110")];
            tensor<int32, [4]> concat_1 = concat(axis = concat_1_axis_0, interleave = concat_1_interleave_0, values = (gather_1_cast_uint16_to_int32, gather_2_cast_uint16_to_int32, var_23, var_22))[name = string("concat_1")];
            tensor<fp16, [?, ?, 12, 32]> x_3_cast_fp16 = reshape(shape = concat_1, x = linear_1_cast_fp16)[name = string("x_3_cast_fp16")];
            tensor<fp16, [384, 384]> model_encoder_layer_0_attention_self_value_weight_to_fp16 = const()[name = string("model_encoder_layer_0_attention_self_value_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(24431296)))];
            tensor<fp16, [384]> model_encoder_layer_0_attention_self_value_bias_to_fp16 = const()[name = string("model_encoder_layer_0_attention_self_value_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(24726272)))];
            tensor<fp16, [?, ?, 384]> linear_2_cast_fp16 = linear(bias = model_encoder_layer_0_attention_self_value_bias_to_fp16, weight = model_encoder_layer_0_attention_self_value_weight_to_fp16, x = input_7_cast_fp16)[name = string("linear_2_cast_fp16")];
            tensor<int32, [3]> var_109_shape_cast_fp16 = shape(x = linear_2_cast_fp16)[name = string("op_109_shape_cast_fp16")];
            int32 gather_3_axis_0 = const()[name = string("gather_3_axis_0"), val = int32(0)];
            int32 gather_3_batch_dims_0 = const()[name = string("gather_3_batch_dims_0"), val = int32(0)];
            bool gather_3_validate_indices_0 = const()[name = string("gather_3_validate_indices_0"), val = bool(false)];
            string var_109_shape_cast_fp16_to_uint16_dtype_0 = const()[name = string("op_109_shape_cast_fp16_to_uint16_dtype_0"), val = string("uint16")];
            uint16 gather_3_indices_0_to_uint16 = const()[name = string("gather_3_indices_0_to_uint16"), val = uint16(0)];
            tensor<uint16, [3]> var_109_shape_cast_fp16_to_uint16 = cast(dtype = var_109_shape_cast_fp16_to_uint16_dtype_0, x = var_109_shape_cast_fp16)[name = string("cast_108")];
            uint16 gather_3_cast_uint16 = gather(axis = gather_3_axis_0, batch_dims = gather_3_batch_dims_0, indices = gather_3_indices_0_to_uint16, validate_indices = gather_3_validate_indices_0, x = var_109_shape_cast_fp16_to_uint16)[name = string("gather_3_cast_uint16")];
            string gather_3_cast_uint16_to_int32_dtype_0 = const()[name = string("gather_3_cast_uint16_to_int32_dtype_0"), val = string("int32")];
            int32 gather_4_axis_0 = const()[name = string("gather_4_axis_0"), val = int32(0)];
            int32 gather_4_batch_dims_0 = const()[name = string("gather_4_batch_dims_0"), val = int32(0)];
            bool gather_4_validate_indices_0 = const()[name = string("gather_4_validate_indices_0"), val = bool(false)];
            uint16 gather_4_indices_0_to_uint16 = const()[name = string("gather_4_indices_0_to_uint16"), val = uint16(1)];
            uint16 gather_4_cast_uint16 = gather(axis = gather_4_axis_0, batch_dims = gather_4_batch_dims_0, indices = gather_4_indices_0_to_uint16, validate_indices = gather_4_validate_indices_0, x = var_109_shape_cast_fp16_to_uint16)[name = string("gather_4_cast_uint16")];
            string gather_4_cast_uint16_to_int32_dtype_0 = const()[name = string("gather_4_cast_uint16_to_int32_dtype_0"), val = string("int32")];
            int32 concat_2_axis_0 = const()[name = string("concat_2_axis_0"), val = int32(0)];
            bool concat_2_interleave_0 = const()[name = string("concat_2_interleave_0"), val = bool(false)];
            int32 gather_4_cast_uint16_to_int32 = cast(dtype = gather_4_cast_uint16_to_int32_dtype_0, x = gather_4_cast_uint16)[name = string("cast_106")];
            int32 gather_3_cast_uint16_to_int32 = cast(dtype = gather_3_cast_uint16_to_int32_dtype_0, x = gather_3_cast_uint16)[name = string("cast_107")];
            tensor<int32, [4]> concat_2 = concat(axis = concat_2_axis_0, interleave = concat_2_interleave_0, values = (gather_3_cast_uint16_to_int32, gather_4_cast_uint16_to_int32, var_23, var_22))[name = string("concat_2")];
            tensor<fp16, [?, ?, 12, 32]> x_7_cast_fp16 = reshape(shape = concat_2, x = linear_2_cast_fp16)[name = string("x_7_cast_fp16")];
            tensor<int32, [4]> var_113 = const()[name = string("op_113"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_115_shape_cast_fp16 = shape(x = linear_0_cast_fp16)[name = string("op_115_shape_cast_fp16")];
            int32 gather_5_axis_0 = const()[name = string("gather_5_axis_0"), val = int32(0)];
            int32 gather_5_batch_dims_0 = const()[name = string("gather_5_batch_dims_0"), val = int32(0)];
            bool gather_5_validate_indices_0 = const()[name = string("gather_5_validate_indices_0"), val = bool(false)];
            string var_115_shape_cast_fp16_to_uint16_dtype_0 = const()[name = string("op_115_shape_cast_fp16_to_uint16_dtype_0"), val = string("uint16")];
            uint16 gather_5_indices_0_to_uint16 = const()[name = string("gather_5_indices_0_to_uint16"), val = uint16(0)];
            tensor<uint16, [3]> var_115_shape_cast_fp16_to_uint16 = cast(dtype = var_115_shape_cast_fp16_to_uint16_dtype_0, x = var_115_shape_cast_fp16)[name = string("cast_105")];
            uint16 gather_5_cast_uint16 = gather(axis = gather_5_axis_0, batch_dims = gather_5_batch_dims_0, indices = gather_5_indices_0_to_uint16, validate_indices = gather_5_validate_indices_0, x = var_115_shape_cast_fp16_to_uint16)[name = string("gather_5_cast_uint16")];
            string gather_5_cast_uint16_to_int32_dtype_0 = const()[name = string("gather_5_cast_uint16_to_int32_dtype_0"), val = string("int32")];
            int32 gather_6_axis_0 = const()[name = string("gather_6_axis_0"), val = int32(0)];
            int32 gather_6_batch_dims_0 = const()[name = string("gather_6_batch_dims_0"), val = int32(0)];
            bool gather_6_validate_indices_0 = const()[name = string("gather_6_validate_indices_0"), val = bool(false)];
            uint16 gather_6_indices_0_to_uint16 = const()[name = string("gather_6_indices_0_to_uint16"), val = uint16(1)];
            uint16 gather_6_cast_uint16 = gather(axis = gather_6_axis_0, batch_dims = gather_6_batch_dims_0, indices = gather_6_indices_0_to_uint16, validate_indices = gather_6_validate_indices_0, x = var_115_shape_cast_fp16_to_uint16)[name = string("gather_6_cast_uint16")];
            string gather_6_cast_uint16_to_int32_dtype_0 = const()[name = string("gather_6_cast_uint16_to_int32_dtype_0"), val = string("int32")];
            int32 concat_3_axis_0 = const()[name = string("concat_3_axis_0"), val = int32(0)];
            bool concat_3_interleave_0 = const()[name = string("concat_3_interleave_0"), val = bool(false)];
            int32 gather_6_cast_uint16_to_int32 = cast(dtype = gather_6_cast_uint16_to_int32_dtype_0, x = gather_6_cast_uint16)[name = string("cast_103")];
            int32 gather_5_cast_uint16_to_int32 = cast(dtype = gather_5_cast_uint16_to_int32_dtype_0, x = gather_5_cast_uint16)[name = string("cast_104")];
            tensor<int32, [4]> concat_3 = concat(axis = concat_3_axis_0, interleave = concat_3_interleave_0, values = (gather_5_cast_uint16_to_int32, gather_6_cast_uint16_to_int32, var_23, var_22))[name = string("concat_3")];
            tensor<fp16, [?, ?, 12, 32]> x_11_cast_fp16 = reshape(shape = concat_3, x = linear_0_cast_fp16)[name = string("x_11_cast_fp16")];
            bool attention_scores_1_transpose_x_0 = const()[name = string("attention_scores_1_transpose_x_0"), val = bool(false)];
            bool attention_scores_1_transpose_y_0 = const()[name = string("attention_scores_1_transpose_y_0"), val = bool(false)];
            tensor<int32, [4]> transpose_18_perm_0 = const()[name = string("transpose_18_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_19_perm_0 = const()[name = string("transpose_19_perm_0"), val = tensor<int32, [4]>([0, 2, -1, -3])];
            tensor<fp16, [?, 12, 32, ?]> transpose_19 = transpose(perm = transpose_19_perm_0, x = x_3_cast_fp16)[name = string("transpose_51")];
            tensor<fp16, [?, 12, ?, 32]> transpose_18 = transpose(perm = transpose_18_perm_0, x = x_11_cast_fp16)[name = string("transpose_52")];
            tensor<fp16, [?, 12, ?, ?]> attention_scores_1_cast_fp16 = matmul(transpose_x = attention_scores_1_transpose_x_0, transpose_y = attention_scores_1_transpose_y_0, x = transpose_18, y = transpose_19)[name = string("attention_scores_1_cast_fp16")];
            fp16 _inversed_attention_scores_3_y_0_to_fp16 = const()[name = string("_inversed_attention_scores_3_y_0_to_fp16"), val = fp16(0x1.6ap-3)];
            tensor<fp16, [?, 12, ?, ?]> _inversed_attention_scores_3_cast_fp16 = mul(x = attention_scores_1_cast_fp16, y = _inversed_attention_scores_3_y_0_to_fp16)[name = string("_inversed_attention_scores_3_cast_fp16")];
            tensor<fp16, [?, 12, ?, ?]> input_11_cast_fp16 = add(x = _inversed_attention_scores_3_cast_fp16, y = attention_mask_cast_fp16)[name = string("input_11_cast_fp16")];
            tensor<fp16, [?, 12, ?, ?]> input_13_cast_fp16 = softmax(axis = var_24, x = input_11_cast_fp16)[name = string("input_13_cast_fp16")];
            bool context_layer_1_transpose_x_0 = const()[name = string("context_layer_1_transpose_x_0"), val = bool(false)];
            bool context_layer_1_transpose_y_0 = const()[name = string("context_layer_1_transpose_y_0"), val = bool(false)];
            tensor<fp16, [?, 12, ?, 32]> value_layer_1_cast_fp16 = transpose(perm = var_113, x = x_7_cast_fp16)[name = string("transpose_53")];
            tensor<fp16, [?, 12, ?, 32]> context_layer_1_cast_fp16 = matmul(transpose_x = context_layer_1_transpose_x_0, transpose_y = context_layer_1_transpose_y_0, x = input_13_cast_fp16, y = value_layer_1_cast_fp16)[name = string("context_layer_1_cast_fp16")];
            tensor<int32, [4]> var_129 = const()[name = string("op_129"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [?, ?, 12, 32]> var_130_cast_fp16 = transpose(perm = var_129, x = context_layer_1_cast_fp16)[name = string("transpose_50")];
            tensor<int32, [4]> var_132_shape_cast_fp16 = shape(x = var_130_cast_fp16)[name = string("op_132_shape_cast_fp16")];
            int32 gather_7_axis_0 = const()[name = string("gather_7_axis_0"), val = int32(0)];
            int32 gather_7_batch_dims_0 = const()[name = string("gather_7_batch_dims_0"), val = int32(0)];
            bool gather_7_validate_indices_0 = const()[name = string("gather_7_validate_indices_0"), val = bool(false)];
            string var_132_shape_cast_fp16_to_uint16_dtype_0 = const()[name = string("op_132_shape_cast_fp16_to_uint16_dtype_0"), val = string("uint16")];
            uint16 gather_7_indices_0_to_uint16 = const()[name = string("gather_7_indices_0_to_uint16"), val = uint16(0)];
            tensor<uint16, [4]> var_132_shape_cast_fp16_to_uint16 = cast(dtype = var_132_shape_cast_fp16_to_uint16_dtype_0, x = var_132_shape_cast_fp16)[name = string("cast_102")];
            uint16 gather_7_cast_uint16 = gather(axis = gather_7_axis_0, batch_dims = gather_7_batch_dims_0, indices = gather_7_indices_0_to_uint16, validate_indices = gather_7_validate_indices_0, x = var_132_shape_cast_fp16_to_uint16)[name = string("gather_7_cast_uint16")];
            string gather_7_cast_uint16_to_int32_dtype_0 = const()[name = string("gather_7_cast_uint16_to_int32_dtype_0"), val = string("int32")];
            int32 gather_8_axis_0 = const()[name = string("gather_8_axis_0"), val = int32(0)];
            int32 gather_8_batch_dims_0 = const()[name = string("gather_8_batch_dims_0"), val = int32(0)];
            bool gather_8_validate_indices_0 = const()[name = string("gather_8_validate_indices_0"), val = bool(false)];
            uint16 gather_8_indices_0_to_uint16 = const()[name = string("gather_8_indices_0_to_uint16"), val = uint16(1)];
            uint16 gather_8_cast_uint16 = gather(axis = gather_8_axis_0, batch_dims = gather_8_batch_dims_0, indices = gather_8_indices_0_to_uint16, validate_indices = gather_8_validate_indices_0, x = var_132_shape_cast_fp16_to_uint16)[name = string("gather_8_cast_uint16")];
            string gather_8_cast_uint16_to_int32_dtype_0 = const()[name = string("gather_8_cast_uint16_to_int32_dtype_0"), val = string("int32")];
            int32 concat_4_axis_0 = const()[name = string("concat_4_axis_0"), val = int32(0)];
            bool concat_4_interleave_0 = const()[name = string("concat_4_interleave_0"), val = bool(false)];
            int32 gather_8_cast_uint16_to_int32 = cast(dtype = gather_8_cast_uint16_to_int32_dtype_0, x = gather_8_cast_uint16)[name = string("cast_100")];
            int32 gather_7_cast_uint16_to_int32 = cast(dtype = gather_7_cast_uint16_to_int32_dtype_0, x = gather_7_cast_uint16)[name = string("cast_101")];
            tensor<int32, [3]> concat_4 = concat(axis = concat_4_axis_0, interleave = concat_4_interleave_0, values = (gather_7_cast_uint16_to_int32, gather_8_cast_uint16_to_int32, var_27))[name = string("concat_4")];
            tensor<fp16, [?, ?, 384]> input_15_cast_fp16 = reshape(shape = concat_4, x = var_130_cast_fp16)[name = string("input_15_cast_fp16")];
            tensor<fp16, [384, 384]> model_encoder_layer_0_attention_output_dense_weight_to_fp16 = const()[name = string("model_encoder_layer_0_attention_output_dense_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(24727104)))];
            tensor<fp16, [384]> model_encoder_layer_0_attention_output_dense_bias_to_fp16 = const()[name = string("model_encoder_layer_0_attention_output_dense_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(25022080)))];
            tensor<fp16, [?, ?, 384]> linear_3_cast_fp16 = linear(bias = model_encoder_layer_0_attention_output_dense_bias_to_fp16, weight = model_encoder_layer_0_attention_output_dense_weight_to_fp16, x = input_15_cast_fp16)[name = string("linear_3_cast_fp16")];
            tensor<fp16, [?, ?, 384]> input_19_cast_fp16 = add(x = linear_3_cast_fp16, y = input_7_cast_fp16)[name = string("input_19_cast_fp16")];
            tensor<int32, [1]> input_21_axes_0 = const()[name = string("input_21_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> model_encoder_layer_0_attention_output_LayerNorm_weight_to_fp16 = const()[name = string("model_encoder_layer_0_attention_output_LayerNorm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(25022912)))];
            tensor<fp16, [384]> model_encoder_layer_0_attention_output_LayerNorm_bias_to_fp16 = const()[name = string("model_encoder_layer_0_attention_output_LayerNorm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(25023744)))];
            tensor<fp16, [?, ?, 384]> input_21_cast_fp16 = layer_norm(axes = input_21_axes_0, beta = model_encoder_layer_0_attention_output_LayerNorm_bias_to_fp16, epsilon = var_26_to_fp16, gamma = model_encoder_layer_0_attention_output_LayerNorm_weight_to_fp16, x = input_19_cast_fp16)[name = string("input_21_cast_fp16")];
            tensor<fp16, [1536, 384]> model_encoder_layer_0_intermediate_dense_weight_to_fp16 = const()[name = string("model_encoder_layer_0_intermediate_dense_weight_to_fp16"), val = tensor<fp16, [1536, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(25024576)))];
            tensor<fp16, [1536]> model_encoder_layer_0_intermediate_dense_bias_to_fp16 = const()[name = string("model_encoder_layer_0_intermediate_dense_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(26204288)))];
            tensor<fp16, [?, ?, 1536]> linear_4_cast_fp16 = linear(bias = model_encoder_layer_0_intermediate_dense_bias_to_fp16, weight = model_encoder_layer_0_intermediate_dense_weight_to_fp16, x = input_21_cast_fp16)[name = string("linear_4_cast_fp16")];
            string input_25_mode_0 = const()[name = string("input_25_mode_0"), val = string("EXACT")];
            tensor<fp16, [?, ?, 1536]> input_25_cast_fp16 = gelu(mode = input_25_mode_0, x = linear_4_cast_fp16)[name = string("input_25_cast_fp16")];
            tensor<fp16, [384, 1536]> model_encoder_layer_0_output_dense_weight_to_fp16 = const()[name = string("model_encoder_layer_0_output_dense_weight_to_fp16"), val = tensor<fp16, [384, 1536]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(26207424)))];
            tensor<fp16, [384]> model_encoder_layer_0_output_dense_bias_to_fp16 = const()[name = string("model_encoder_layer_0_output_dense_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(27387136)))];
            tensor<fp16, [?, ?, 384]> linear_5_cast_fp16 = linear(bias = model_encoder_layer_0_output_dense_bias_to_fp16, weight = model_encoder_layer_0_output_dense_weight_to_fp16, x = input_25_cast_fp16)[name = string("linear_5_cast_fp16")];
            tensor<fp16, [?, ?, 384]> input_29_cast_fp16 = add(x = linear_5_cast_fp16, y = input_21_cast_fp16)[name = string("input_29_cast_fp16")];
            tensor<int32, [1]> input_31_axes_0 = const()[name = string("input_31_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> model_encoder_layer_0_output_LayerNorm_weight_to_fp16 = const()[name = string("model_encoder_layer_0_output_LayerNorm_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(27387968)))];
            tensor<fp16, [384]> model_encoder_layer_0_output_LayerNorm_bias_to_fp16 = const()[name = string("model_encoder_layer_0_output_LayerNorm_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(27388800)))];
            tensor<fp16, [?, ?, 384]> input_31_cast_fp16 = layer_norm(axes = input_31_axes_0, beta = model_encoder_layer_0_output_LayerNorm_bias_to_fp16, epsilon = var_26_to_fp16, gamma = model_encoder_layer_0_output_LayerNorm_weight_to_fp16, x = input_29_cast_fp16)[name = string("input_31_cast_fp16")];
            tensor<fp16, [384, 384]> model_encoder_layer_1_attention_self_query_weight_to_fp16 = const()[name = string("model_encoder_layer_1_attention_self_query_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(27389632)))];
            tensor<fp16, [384]> model_encoder_layer_1_attention_self_query_bias_to_fp16 = const()[name = string("model_encoder_layer_1_attention_self_query_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(27684608)))];
            tensor<fp16, [?, ?, 384]> linear_6_cast_fp16 = linear(bias = model_encoder_layer_1_attention_self_query_bias_to_fp16, weight = model_encoder_layer_1_attention_self_query_weight_to_fp16, x = input_31_cast_fp16)[name = string("linear_6_cast_fp16")];
            tensor<fp16, [384, 384]> model_encoder_layer_1_attention_self_key_weight_to_fp16 = const()[name = string("model_encoder_layer_1_attention_self_key_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(27685440)))];
            tensor<fp16, [384]> model_encoder_layer_1_attention_self_key_bias_to_fp16 = const()[name = string("model_encoder_layer_1_attention_self_key_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(27980416)))];
            tensor<fp16, [?, ?, 384]> linear_7_cast_fp16 = linear(bias = model_encoder_layer_1_attention_self_key_bias_to_fp16, weight = model_encoder_layer_1_attention_self_key_weight_to_fp16, x = input_31_cast_fp16)[name = string("linear_7_cast_fp16")];
            tensor<int32, [3]> var_177_shape_cast_fp16 = shape(x = linear_7_cast_fp16)[name = string("op_177_shape_cast_fp16")];
            int32 gather_9_axis_0 = const()[name = string("gather_9_axis_0"), val = int32(0)];
            int32 gather_9_batch_dims_0 = const()[name = string("gather_9_batch_dims_0"), val = int32(0)];
            bool gather_9_validate_indices_0 = const()[name = string("gather_9_validate_indices_0"), val = bool(false)];
            string var_177_shape_cast_fp16_to_uint16_dtype_0 = const()[name = string("op_177_shape_cast_fp16_to_uint16_dtype_0"), val = string("uint16")];
            uint16 gather_9_indices_0_to_uint16 = const()[name = string("gather_9_indices_0_to_uint16"), val = uint16(0)];
            tensor<uint16, [3]> var_177_shape_cast_fp16_to_uint16 = cast(dtype = var_177_shape_cast_fp16_to_uint16_dtype_0, x = var_177_shape_cast_fp16)[name = string("cast_99")];
            uint16 gather_9_cast_uint16 = gather(axis = gather_9_axis_0, batch_dims = gather_9_batch_dims_0, indices = gather_9_indices_0_to_uint16, validate_indices = gather_9_validate_indices_0, x = var_177_shape_cast_fp16_to_uint16)[name = string("gather_9_cast_uint16")];
            string gather_9_cast_uint16_to_int32_dtype_0 = const()[name = string("gather_9_cast_uint16_to_int32_dtype_0"), val = string("int32")];
            int32 gather_10_axis_0 = const()[name = string("gather_10_axis_0"), val = int32(0)];
            int32 gather_10_batch_dims_0 = const()[name = string("gather_10_batch_dims_0"), val = int32(0)];
            bool gather_10_validate_indices_0 = const()[name = string("gather_10_validate_indices_0"), val = bool(false)];
            uint16 gather_10_indices_0_to_uint16 = const()[name = string("gather_10_indices_0_to_uint16"), val = uint16(1)];
            uint16 gather_10_cast_uint16 = gather(axis = gather_10_axis_0, batch_dims = gather_10_batch_dims_0, indices = gather_10_indices_0_to_uint16, validate_indices = gather_10_validate_indices_0, x = var_177_shape_cast_fp16_to_uint16)[name = string("gather_10_cast_uint16")];
            string gather_10_cast_uint16_to_int32_dtype_0 = const()[name = string("gather_10_cast_uint16_to_int32_dtype_0"), val = string("int32")];
            int32 concat_5_axis_0 = const()[name = string("concat_5_axis_0"), val = int32(0)];
            bool concat_5_interleave_0 = const()[name = string("concat_5_interleave_0"), val = bool(false)];
            int32 gather_10_cast_uint16_to_int32 = cast(dtype = gather_10_cast_uint16_to_int32_dtype_0, x = gather_10_cast_uint16)[name = string("cast_97")];
            int32 gather_9_cast_uint16_to_int32 = cast(dtype = gather_9_cast_uint16_to_int32_dtype_0, x = gather_9_cast_uint16)[name = string("cast_98")];
            tensor<int32, [4]> concat_5 = concat(axis = concat_5_axis_0, interleave = concat_5_interleave_0, values = (gather_9_cast_uint16_to_int32, gather_10_cast_uint16_to_int32, var_23, var_22))[name = string("concat_5")];
            tensor<fp16, [?, ?, 12, 32]> x_15_cast_fp16 = reshape(shape = concat_5, x = linear_7_cast_fp16)[name = string("x_15_cast_fp16")];
            tensor<fp16, [384, 384]> model_encoder_layer_1_attention_self_value_weight_to_fp16 = const()[name = string("model_encoder_layer_1_attention_self_value_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(27981248)))];
            tensor<fp16, [384]> model_encoder_layer_1_attention_self_value_bias_to_fp16 = const()[name = string("model_encoder_layer_1_attention_self_value_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(28276224)))];
            tensor<fp16, [?, ?, 384]> linear_8_cast_fp16 = linear(bias = model_encoder_layer_1_attention_self_value_bias_to_fp16, weight = model_encoder_layer_1_attention_self_value_weight_to_fp16, x = input_31_cast_fp16)[name = string("linear_8_cast_fp16")];
            tensor<int32, [3]> var_186_shape_cast_fp16 = shape(x = linear_8_cast_fp16)[name = string("op_186_shape_cast_fp16")];
            int32 gather_11_axis_0 = const()[name = string("gather_11_axis_0"), val = int32(0)];
            int32 gather_11_batch_dims_0 = const()[name = string("gather_11_batch_dims_0"), val = int32(0)];
            bool gather_11_validate_indices_0 = const()[name = string("gather_11_validate_indices_0"), val = bool(false)];
            string var_186_shape_cast_fp16_to_uint16_dtype_0 = const()[name = string("op_186_shape_cast_fp16_to_uint16_dtype_0"), val = string("uint16")];
            uint16 gather_11_indices_0_to_uint16 = const()[name = string("gather_11_indices_0_to_uint16"), val = uint16(0)];
            tensor<uint16, [3]> var_186_shape_cast_fp16_to_uint16 = cast(dtype = var_186_shape_cast_fp16_to_uint16_dtype_0, x = var_186_shape_cast_fp16)[name = string("cast_96")];
            uint16 gather_11_cast_uint16 = gather(axis = gather_11_axis_0, batch_dims = gather_11_batch_dims_0, indices = gather_11_indices_0_to_uint16, validate_indices = gather_11_validate_indices_0, x = var_186_shape_cast_fp16_to_uint16)[name = string("gather_11_cast_uint16")];
            string gather_11_cast_uint16_to_int32_dtype_0 = const()[name = string("gather_11_cast_uint16_to_int32_dtype_0"), val = string("int32")];
            int32 gather_12_axis_0 = const()[name = string("gather_12_axis_0"), val = int32(0)];
            int32 gather_12_batch_dims_0 = const()[name = string("gather_12_batch_dims_0"), val = int32(0)];
            bool gather_12_validate_indices_0 = const()[name = string("gather_12_validate_indices_0"), val = bool(false)];
            uint16 gather_12_indices_0_to_uint16 = const()[name = string("gather_12_indices_0_to_uint16"), val = uint16(1)];
            uint16 gather_12_cast_uint16 = gather(axis = gather_12_axis_0, batch_dims = gather_12_batch_dims_0, indices = gather_12_indices_0_to_uint16, validate_indices = gather_12_validate_indices_0, x = var_186_shape_cast_fp16_to_uint16)[name = string("gather_12_cast_uint16")];
            string gather_12_cast_uint16_to_int32_dtype_0 = const()[name = string("gather_12_cast_uint16_to_int32_dtype_0"), val = string("int32")];
            int32 concat_6_axis_0 = const()[name = string("concat_6_axis_0"), val = int32(0)];
            bool concat_6_interleave_0 = const()[name = string("concat_6_interleave_0"), val = bool(false)];
            int32 gather_12_cast_uint16_to_int32 = cast(dtype = gather_12_cast_uint16_to_int32_dtype_0, x = gather_12_cast_uint16)[name = string("cast_94")];
            int32 gather_11_cast_uint16_to_int32 = cast(dtype = gather_11_cast_uint16_to_int32_dtype_0, x = gather_11_cast_uint16)[name = string("cast_95")];
            tensor<int32, [4]> concat_6 = concat(axis = concat_6_axis_0, interleave = concat_6_interleave_0, values = (gather_11_cast_uint16_to_int32, gather_12_cast_uint16_to_int32, var_23, var_22))[name = string("concat_6")];
            tensor<fp16, [?, ?, 12, 32]> x_19_cast_fp16 = reshape(shape = concat_6, x = linear_8_cast_fp16)[name = string("x_19_cast_fp16")];
            tensor<int32, [4]> var_190 = const()[name = string("op_190"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_192_shape_cast_fp16 = shape(x = linear_6_cast_fp16)[name = string("op_192_shape_cast_fp16")];
            int32 gather_13_axis_0 = const()[name = string("gather_13_axis_0"), val = int32(0)];
            int32 gather_13_batch_dims_0 = const()[name = string("gather_13_batch_dims_0"), val = int32(0)];
            bool gather_13_validate_indices_0 = const()[name = string("gather_13_validate_indices_0"), val = bool(false)];
            string var_192_shape_cast_fp16_to_uint16_dtype_0 = const()[name = string("op_192_shape_cast_fp16_to_uint16_dtype_0"), val = string("uint16")];
            uint16 gather_13_indices_0_to_uint16 = const()[name = string("gather_13_indices_0_to_uint16"), val = uint16(0)];
            tensor<uint16, [3]> var_192_shape_cast_fp16_to_uint16 = cast(dtype = var_192_shape_cast_fp16_to_uint16_dtype_0, x = var_192_shape_cast_fp16)[name = string("cast_93")];
            uint16 gather_13_cast_uint16 = gather(axis = gather_13_axis_0, batch_dims = gather_13_batch_dims_0, indices = gather_13_indices_0_to_uint16, validate_indices = gather_13_validate_indices_0, x = var_192_shape_cast_fp16_to_uint16)[name = string("gather_13_cast_uint16")];
            string gather_13_cast_uint16_to_int32_dtype_0 = const()[name = string("gather_13_cast_uint16_to_int32_dtype_0"), val = string("int32")];
            int32 gather_14_axis_0 = const()[name = string("gather_14_axis_0"), val = int32(0)];
            int32 gather_14_batch_dims_0 = const()[name = string("gather_14_batch_dims_0"), val = int32(0)];
            bool gather_14_validate_indices_0 = const()[name = string("gather_14_validate_indices_0"), val = bool(false)];
            uint16 gather_14_indices_0_to_uint16 = const()[name = string("gather_14_indices_0_to_uint16"), val = uint16(1)];
            uint16 gather_14_cast_uint16 = gather(axis = gather_14_axis_0, batch_dims = gather_14_batch_dims_0, indices = gather_14_indices_0_to_uint16, validate_indices = gather_14_validate_indices_0, x = var_192_shape_cast_fp16_to_uint16)[name = string("gather_14_cast_uint16")];
            string gather_14_cast_uint16_to_int32_dtype_0 = const()[name = string("gather_14_cast_uint16_to_int32_dtype_0"), val = string("int32")];
            int32 concat_7_axis_0 = const()[name = string("concat_7_axis_0"), val = int32(0)];
            bool concat_7_interleave_0 = const()[name = string("concat_7_interleave_0"), val = bool(false)];
            int32 gather_14_cast_uint16_to_int32 = cast(dtype = gather_14_cast_uint16_to_int32_dtype_0, x = gather_14_cast_uint16)[name = string("cast_91")];
            int32 gather_13_cast_uint16_to_int32 = cast(dtype = gather_13_cast_uint16_to_int32_dtype_0, x = gather_13_cast_uint16)[name = string("cast_92")];
            tensor<int32, [4]> concat_7 = concat(axis = concat_7_axis_0, interleave = concat_7_interleave_0, values = (gather_13_cast_uint16_to_int32, gather_14_cast_uint16_to_int32, var_23, var_22))[name = string("concat_7")];
            tensor<fp16, [?, ?, 12, 32]> x_23_cast_fp16 = reshape(shape = concat_7, x = linear_6_cast_fp16)[name = string("x_23_cast_fp16")];
            bool attention_scores_5_transpose_x_0 = const()[name = string("attention_scores_5_transpose_x_0"), val = bool(false)];
            bool attention_scores_5_transpose_y_0 = const()[name = string("attention_scores_5_transpose_y_0"), val = bool(false)];
            tensor<int32, [4]> transpose_20_perm_0 = const()[name = string("transpose_20_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_21_perm_0 = const()[name = string("transpose_21_perm_0"), val = tensor<int32, [4]>([0, 2, -1, -3])];
            tensor<fp16, [?, 12, 32, ?]> transpose_21 = transpose(perm = transpose_21_perm_0, x = x_15_cast_fp16)[name = string("transpose_47")];
            tensor<fp16, [?, 12, ?, 32]> transpose_20 = transpose(perm = transpose_20_perm_0, x = x_23_cast_fp16)[name = string("transpose_48")];
            tensor<fp16, [?, 12, ?, ?]> attention_scores_5_cast_fp16 = matmul(transpose_x = attention_scores_5_transpose_x_0, transpose_y = attention_scores_5_transpose_y_0, x = transpose_20, y = transpose_21)[name = string("attention_scores_5_cast_fp16")];
            fp16 _inversed_attention_scores_7_y_0_to_fp16 = const()[name = string("_inversed_attention_scores_7_y_0_to_fp16"), val = fp16(0x1.6ap-3)];
            tensor<fp16, [?, 12, ?, ?]> _inversed_attention_scores_7_cast_fp16 = mul(x = attention_scores_5_cast_fp16, y = _inversed_attention_scores_7_y_0_to_fp16)[name = string("_inversed_attention_scores_7_cast_fp16")];
            tensor<fp16, [?, 12, ?, ?]> input_33_cast_fp16 = add(x = _inversed_attention_scores_7_cast_fp16, y = attention_mask_cast_fp16)[name = string("input_33_cast_fp16")];
            tensor<fp16, [?, 12, ?, ?]> input_35_cast_fp16 = softmax(axis = var_24, x = input_33_cast_fp16)[name = string("input_35_cast_fp16")];
            bool context_layer_5_transpose_x_0 = const()[name = string("context_layer_5_transpose_x_0"), val = bool(false)];
            bool context_layer_5_transpose_y_0 = const()[name = string("context_layer_5_transpose_y_0"), val = bool(false)];
            tensor<fp16, [?, 12, ?, 32]> value_layer_3_cast_fp16 = transpose(perm = var_190, x = x_19_cast_fp16)[name = string("transpose_49")];
            tensor<fp16, [?, 12, ?, 32]> context_layer_5_cast_fp16 = matmul(transpose_x = context_layer_5_transpose_x_0, transpose_y = context_layer_5_transpose_y_0, x = input_35_cast_fp16, y = value_layer_3_cast_fp16)[name = string("context_layer_5_cast_fp16")];
            tensor<int32, [4]> var_206 = const()[name = string("op_206"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [?, ?, 12, 32]> var_207_cast_fp16 = transpose(perm = var_206, x = context_layer_5_cast_fp16)[name = string("transpose_46")];
            tensor<int32, [4]> var_209_shape_cast_fp16 = shape(x = var_207_cast_fp16)[name = string("op_209_shape_cast_fp16")];
            int32 gather_15_axis_0 = const()[name = string("gather_15_axis_0"), val = int32(0)];
